[
    {
        "name": "Liú Bèi 刘备",
        "url": "http://sanguoshaenglish.blogspot.com/2010/07/liu-bei.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/_cZXVdsBvjyM/TEhTjL7v0fI/AAAAAAAAADk/q89ZnRg__4c/s1600/shualiubei.jpg",
        "abilityText": "Character ability 1: \"Benevolence 仁德 (rén dé) \"\nYou can give any amount of on-hand cards to any amount of players in his turn. If the total number of cards given away is 2 or more, you regain 1 unit of health.\nCharacter ability 2: [Ruler Ability] \"Rouse 激将 (jī jiàng)\"\nYou can ask any Shu 蜀 character that is in play to use an ATTACK 杀 card for you.\n(The attack is considered as being \"used\" by Liu Bei even though the card itself comes from another player. This means the attack properties such as range and element is based on Liu Bei, not the player that issued the card. Of course, Shu characters in play can choose not to use an ATTACK card for him.)\n"
    },
    {
        "name": "Elder Zhūgě Liàng 暮年诸葛亮",
        "url": "http://sanguoshaenglish.blogspot.com/2010/07/elder-zhu-ge-liang.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TEhVXxX1iUI/AAAAAAAAADs/XMbIhh5RskQ/s1600/shualaozhuge.jpg",
        "abilityText": "Character ability 1: \"Star Gazing 观星 (guān xīng)\"\nAt the beginning of your turn, you can view X number of cards from the top of the deck (X equals to the number of players still in play with X having maximum of 5). Of these X cards, you can choose any number of cards to place at the top or at the bottom of the pile. You can also rearrange the order of the cards.\nCharacter ability 2: \"Empty City 空城 (kōng chéng)\" [Enforced ability]\nWhen you have no cards on hand, you cannot become the target of ATTACK 杀 or DUEL 决斗.\n"
    },
    {
        "name": "Zhào Yún 赵云",
        "url": "http://sanguoshaenglish.blogspot.com/2010/07/zhao-yun.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TE1FJu8xKLI/AAAAAAAAAEE/_YUpNbznpMM/s1600/shuazhaoyun.jpg",
        "abilityText": "Character ability: \"Dragon Heart 龙胆 (lóng dǎn)\"\nAll your ATTACK 杀 and DODGE 闪 cards can be used interchangeably.\n"
    },
    {
        "name": "Guān Yǔ 关羽",
        "url": "http://sanguoshaenglish.blogspot.com/2010/07/guan-yu.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TEhV_GtIovI/AAAAAAAAAD0/Pd0GJnOqigk/s1600/shuguanyu.jpg",
        "abilityText": "Character ability: \"Warrior Saint 武圣 (wǔ shèng)\"\nYou can use any card with a \"heart\" or \"diamonds\" suit as an ATTACK 杀 card.\n"
    },
    {
        "name": "Huáng Yuè Yīng 黄月英",
        "url": "http://sanguoshaenglish.blogspot.com/2010/07/huang-yue-ying.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/_cZXVdsBvjyM/TE5JUPbku_I/AAAAAAAAAEc/S--YWS6-Etc/s1600/shuhuangyueying.jpg",
        "abilityText": "Character ability 1: \"Assembling Wisdom 集智 (jí zhì)\"\nEverytime you use a tool card (except time-delay tool cards), you can immediately draw another card from the deck.\n(This is valid even if the tool card is used outside of that player's turn (such as when\nNEGATE 无懈可击\nis used). This is the ability that makes her very deadly. When Huang Yue Ying has a hand-full of tool cards, her turn seemingly never ends. Although she can only ATTACK 杀 once, tools can be used without restriction. She can draw 3 cards when she uses DRAW2 无中生有.)\nSpecial note about her skill \"Assembling Wisdom\" when using\nIRON SHACKLES 铁索连环\n. When the card is played as \"RE-DRAW 重铸\", Huang Yue Ying cannot draw take 2 cards instead of 1 from the deck. This is because \"RE-DRAW\" is not considered\nusing\nthe card, but simply exchanging it for another. This information is acquired from the official game forum, though the post is all in Chinese.\nClick here to visit the post.\nCharacter ability 2: \"Genius 奇才 (qí cái)\"\nThere is no range restriction on all your tool cards.\n(This means she can use\nSTEAL 顺手牵羊\nand\nRATIONS DEPLETED 兵粮寸断\non any character in play.)\n"
    },
    {
        "name": "Mǎ Chāo 马超",
        "url": "http://sanguoshaenglish.blogspot.com/2010/07/ma-chao.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/_cZXVdsBvjyM/TFKd58M5YKI/AAAAAAAAAE8/xwrCWwrOs_c/s1600/shumachao.jpg",
        "abilityText": "Character ability 1: \"Horsemanship 马术 (mǎ shù)\" [Enforced ability]\nYou will always be -1 distance in any range calculations.\n(This means that when he equips a \"-1 horse\", he will have a physical distance advantage totaling -2.)\nCharacter ability 2: \"Iron Calvary 铁骑 (tiě jì)\"\nWhenever you use an ATTACK 杀 on any target player, you can choose to flip over one judgement card from the deck. If the judgement card is of a red-suit (hearts and diamonds), the ATTACK cannot be evaded with DODGE 闪.\n"
    },
    {
        "name": "Zhāng Fēi 张飞",
        "url": "http://sanguoshaenglish.blogspot.com/2010/07/zhang-fei.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/_cZXVdsBvjyM/TE1FZ3S6z4I/AAAAAAAAAEM/TLGLvJ-ATvk/s1600/shuzhangfei.jpg",
        "abilityText": "Character ability: \"Berserk 咆哮 (páo xiāo)\"\nYou can use as many ATTACK 杀 cards as you wish during your turn.\n(Effectively, Zhang Fei has the\nZhu Ge Crossbow 诸葛连弩\nequipped by default. He will always have the \"Berserk\" ability regardless of what weapon he has equipped.)\n"
    },
    {
        "name": "Younger Zhū Gě Liàng 卧龙诸葛亮",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/younger-zhu-ge-liang.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TFUL5Li3FxI/AAAAAAAAAFU/CF7tNP0K23w/s1600/shuzhuge.jpg",
        "abilityText": "Character ability 1: \"Eight Trigrams Formation 八阵 (bā zhèn)\" [Enforced ability]\nWhen no armour is equipped, you will always have the protection of the\nEIGHT TRIGRAMS 八卦阵\narmour by default.\nCharacter ability 2: \"Arson 火计 (huǒ jì)\"\nAll your on-hand cards with a red suit (\"hearts\" or \"diamonds\") can be used as\nBLAZE 火攻\nduring your action phase.\nCharacter ability 3: \"Scient 看破 (kàn pò)\"\nAll your on-hand cards with a black suit (\"clubs\" or \"spades\") can be used as\nNEGATE 无懈可击\n.\n"
    },
    {
        "name": "Páng Tǒng 庞统",
        "url": "http://sanguoshaenglish.blogspot.com/2010/07/pang-tong.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/_cZXVdsBvjyM/TFKeMZ2mnoI/AAAAAAAAAFE/qKN9qe9vveA/s1600/shupangtong.jpg",
        "abilityText": "Character ability 1: \"Shackle 连环 (lián huán)\"\nEvery on-hand card that has the suit of \"clubs\" can be used as\nIRON SHACKLES 铁索连环\n.\n(This also means that card, regardless of its original function, can perform RE-DRAW 重铸, ie: discarded and replaced with a new card from the deck).\nCharacter ability 2: \"Nirvana 涅盘 (niè pán)\" [Single-use ability]\nWhen you are on the brink of death, you can choose to discard all your cards (both on-hand and equipped) and resurrect yourself. You will have 3 units of health after resurrection and can immediately draw 3 cards from the deck.\n(This ability can only be used once. A symbol or marking (unspecified in the instructions) should be used to inform all players that \"Nirvana\" has already been used once.)\n"
    },
    {
        "name": "Huáng Zhōng 黄忠",
        "url": "http://sanguoshaenglish.blogspot.com/2010/07/huang-zhong.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TFEN07YIuMI/AAAAAAAAAE0/k67vOXtWsYQ/s1600/shuhuangzhong.jpg",
        "abilityText": "Character ability: \"Fearsome Archer 烈弓 (liè gōng)\"\nIn the action phase, your ATTACK 杀 cannot be evaded by DODGE 闪 under the following 2 circumstances:\n1. The number of on-hand cards of the target player is less than or equal to your attacking range.\n2. The number of on-hand cards of the target player is more than or equal to the units of health you have remaining.\nWith a little extrapolation of the possibilities, you will notice that when Huang Zhong has only 1 unit of health left, any target player he uses ATTACK on cannot DODGE. \"Undodgeable\" ATTACK by Huang Zhong is therefore possible anytime his health remaining is less than or equal to his attacking range.\n"
    },
    {
        "name": "Wèi Yán 魏延",
        "url": "http://sanguoshaenglish.blogspot.com/2010/07/wei-yan.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TFKeXB1mwVI/AAAAAAAAAFM/uSsGS0-Mzrs/s1600/shuweiyan.jpg",
        "abilityText": "Character ability: \"Insanity Streak 狂骨 (kuáng gǔ)\" [Enforced ability]\nWhenever you cause damage to any player within physical range of 1, you regain 1 unit of health for every 1 unit of damage caused.\n(Taking this to the extreme, Wei Yan can regain 4 units of health if he has equipped \"-1 horse\", uses\nBARBARIANS 南蛮入侵\n, and the 4 players to his immediate left and right all suffer damage. Since this is an enforced ability, he cannot choose not to absorb health.)\n"
    },
    {
        "name": "Mèng Huò 孟获",
        "url": "http://sanguoshaenglish.blogspot.com/2010/09/meng-huo.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/_cZXVdsBvjyM/TH0OkvdH3GI/AAAAAAAAAWk/3S6h4rtf9v4/s1600/shumenghuo.jpg",
        "abilityText": "Character ability 1: [Enforced ability] \"The Smoking Gun 祸首 (huò shǒu)\"\nThe tool card\nBARBARIANS 南蛮入侵\nhas no effect on you. You will be the source of any damage caused by the use of BARBARIANS.\n(This means any follow-up ability (retaliatory or advantageous) of other characters will target Meng Huo instead of the character who played the card.)\nCharacter ability 2: \"Arise Again 再起 (zài qǐ)\"\nDuring the drawing phase, iIf you are not at full health, you can choose to give up the drawing phase and, instead, flip X number of cards from the deck (X being the amount of health you have lost thus far). Of these X cards, you will regain 1 unit of health for every card with the suit of \"hearts\". The cards with \"hearts\" will be discarded while the remaining cards that were flipped will be kept into your hand.\n"
    },
    {
        "name": "Zhù Róng 祝融",
        "url": "http://sanguoshaenglish.blogspot.com/2010/09/zhu-rong.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/_cZXVdsBvjyM/TH0PXfgfaXI/AAAAAAAAAWs/eqV8nJMQzB0/s1600/shuzhurong.jpg",
        "abilityText": "Character ability 1: [Enforced ability] \"Giant Elephant 巨象 (jù xiàng)\"\nThe tool card\nBARBARIANS 南蛮入侵\nhas no effect on you. When any other player uses BARBARIANS and the card's effects are concluded, you will acquire the BARBARIANS card that was used.\nCharacter ability 2: \"Fearsome Blade 烈刃 (liè rèn)\"\nWhenever your ATTACK 杀 successfully damages your target player, you can choose to \"\nPoints Duel\n\" with that same target player. If you win the Points Duel, you gets to take 1 card (on-hand or equipped) from the target and keep for yourself.\n"
    },
    {
        "name": "Fǎ Zhèng 法正",
        "url": "http://sanguoshaenglish.blogspot.com/2011/07/fa-zheng.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/-GD16kkNL_To/TeY3u-bxFuI/AAAAAAAAA1s/jks38lkma_c/s1600/fazheng.jpg",
        "abilityText": "Character ability 1: Reciprocation 恩怨 (ēn yuàn) [Enforced ability]\nWhenever any other player regains your health by 1 unit, that player can draw 1 card. Every instance that any other player deals you damage, that player must give you an on-hand card of the \"hearts\" suit, or else that player will lose 1 unit of health.\nCharacter ability 2: Artifice of the Masses 眩惑 (xuàn huò)\nIn your action phase, you can give one on-hand card with the suit of \"hearts\" to any other player, then take any 1 card from that player and immediately give it to another player. Limited to one use per turn.\n(Note: For \"Artifice\", after you take 1 card from the player, you can choose to keep it in your on-hand cards. The words \"give it to another player\" includes yourself.)\n[2012 New version]\nCharacter ability 1: Reciprocation 恩怨 (ēn yuàn)\nWhenever you receive 2 or more cards from another player, you can allow that player to draw 1 card. Whenever you have received 1 unit of damage, you can make the source of the damage give you 1 on-hand card, or he/she loses 1 unit of health.\nCharacter ability 2: Artifice of the Masses 眩惑 (xuàn huò)\nIn the drawing phase, you can forgo drawing cards and force another player to draw 2 cards, then let that player use an ATTACK on another player of your choice that is within his/her attacking range. If the player does not abide by your instructions, you will receive those 2 cards that the player drew.\n"
    },
    {
        "name": "Mǎ Sù 马谡",
        "url": "http://sanguoshaenglish.blogspot.com/2011/06/ma-su.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/-9W0_DaJH_wc/TeY32NP5s7I/AAAAAAAAA14/eGsO5HEyEr4/s1600/masu.jpg",
        "abilityText": "Character ability 1: Winning Hearts 心战 (xīn zhàn)\nIn your action phase, if your number of on-hand cards exceeds your maximum health units, you can view the top 3 cards of the deck. Of these 3, display any number of cards that are of the heart suit, then keep them in your hand. Replace the remainder of the 3 cards (if any) in any order back on the top of the deck. Limited to once per turn.\nCharacter ability 2: Tears of Reluctance 挥泪 (huī lèi) [Enforced ability]\nThe player that kills you must discard all his or her cards (both on-hand and equipped) immediately.\n"
    },
    {
        "name": "Xú Shù 徐庶",
        "url": "http://sanguoshaenglish.blogspot.com/2011/06/xu-shu.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/-XVmvSpirGeM/TeY39VhNjXI/AAAAAAAAA2E/QXxHW026bsc/s1600/xushu.jpg",
        "abilityText": "Character ability 1: Silence 无言 (wú yán) [Enforced ability]\nWith the exception of Time-delayed tool cards, all other tool cards used by you have no effect on all other players. Similar tool cards used by all other players have no effect on you.\nCharacter ability 2: Dragon's Advocate 举荐 (jǔ jiàn)\nIn the action phase, you can discard up to 3 cards, then allow 1 other player of your choice to draw an equal number of cards from the deck. If you discard no less than 3 cards of similar type (basic, tool card, equipment card), you regain 1 unit of health. Limited to once per turn.\n[2012 New version]\nCharacter ability 1: Silence 无言 (wú yán) [Enforced ability]\nAll damage caused by, or received from, tool cards is prevented.\nCharacter ability 2: Dragon's Advocate 举荐 (jǔ jiàn)\nWhen the ending phase of your turn begins, you can discard 1 non-Basic card (ie: Tools cards, equipment cards, etc). If you do so, you let another player choose 1 of the following 3 possible actions:\n1. Draw 2 cards.\n2. Regain 1 unit of health.\n3. Flip over the character card such that it faces right-side up, and rotated in the vertical orientation (ie: chains are broken).\n"
    },
    {
        "name": "Liú Shàn 刘禅",
        "url": "http://sanguoshaenglish.blogspot.com/2011/08/liu-shan.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/-mB8NwGfqsaU/TkKbp8ct1KI/AAAAAAAAA30/2pczIuUU8is/s1600/liushan.jpg",
        "abilityText": "Character ability 1: \"Relish 享乐 (xiǎng lè)\" [Enforced ability]\nWhenever other player targets an ATTACK 杀 at you, he/she must discard a basic card, or that ATTACK has no effect on you.\nCharacter ability 2: \"Devolution 放权 (fàng quán)\"\nYou can skip your action phase. If you do so, you can discard an on-hand card at the end of your turn and let another player go an extra turn.\nCharacter ability 3: \"Eiron 若愚\" [Ruler ability] [Awakening ability]\nAt the start of your turn, if your health is the least or among the least, you must raise your maximum health by 1 unit, regain 1 unit of health and permanently acquire get the ability \"Rouse 激将\".\n(Note: \"Rouse\" is Liu Bei's Ruler ability, where Shu characters can use an ATTACK on his behalf.)\n"
    },
    {
        "name": "Jiāng Wéi 姜维",
        "url": "http://sanguoshaenglish.blogspot.com/2011/08/jiang-wei.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/-N4DUgPgcdCA/TkKbwRArAuI/AAAAAAAAA38/yVpw5heoty4/s1600/jiangwei.jpg",
        "abilityText": "Character ability 1: “Taunt 挑衅 (tiǎo xìn)”\nDuring the action phase, you can pick a player that is able to strike you using ATTACK 杀. That player must use an ATTACK on you. If the player does not do so, you can discard one of his/her card. Limited to once per turn.\nCharacter ability 2: “Recommence the Legacy 志继 (zhì jì)” [Awakening ability]\nAt the start of your turn, if you have no on-hand cards, you must regain 1 unit of health or draw 2 cards, then reduce your maximum health by 1 unit, and permanently acquire the ability “Star Gazing 观星”.\n(Note: \"Star Gazing\" is Elder Zhuge Liang's ability where he can view the top few cards of the deck at the start of his turn)\n"
    },
    {
        "name": "Sūn Shàng Xiáng 孙尚香 (SP005)",
        "url": "http://sanguoshaenglish.blogspot.com/2011/11/sun-shang-xiang-sp.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/-GjzFO-cKXrE/Tp7Cgqj2uaI/AAAAAAAAA5s/OKB1Z5up0iI/s1600/spsunshangxiang.jpg",
        "abilityText": "Character ability1: “Marriage 结姻 (jié yīn)”\nDuring the action phase, you can choose to discard 2 on-hand cards and pick any male character that is not at full-health. By doing so, both the male character and yourself will recover 1 unit of health each. Limited to only 1 use per turn.\nCharacter ability2: “Warrior Lady 枭姬 (xiāo jī)”\nWhenever any equipped card is removed from your equipped items area, you can immediately draw 2 cards from the deck.\n(Note that 2 cards can be drawn for each equipped card that is removed. This applies also to changing the equipped item (ie: replacing one weapon with another weapon).\n"
    },
    {
        "name": "Mǎ Dài 马岱",
        "url": "http://sanguoshaenglish.blogspot.com/2012/06/ma-dai.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/--ipQCiK9t-o/T8srKhUpaYI/AAAAAAAABZw/t94BAy8mfbo/s1600/madai.jpg",
        "abilityText": "Character ability 1: Horsemanship 马术 (mǎ shù) [Enforced Ability]\nIn distance calculations between you and other players, you will always be at -1.\nCharacter ability 2: Backstab 潜袭 (qián xí)\nWhenever you use ATTACK 杀 to cause damage to a player within distance of 1, you can flip a judgement card. If the judgement is not hearts, you prevent this damage and instead cause the player reduce his max health units by 1.\n"
    },
    {
        "name": "Liào Huà 廖化",
        "url": "http://sanguoshaenglish.blogspot.com/2012/06/liao-hua.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/-VRcefn2-_Ik/T95uqyKAoNI/AAAAAAAABaY/81ydHRtPylY/s1600/liaohua.jpg",
        "abilityText": "Character Ability 1: Forefront 当先 (dāng xiān) [Enforced ability]\nAt the beginning of the turn, you perform an extra action phase.\nCharacter Ability 2: Longetivity 伏枥 (fú lì) [Single-use ability]\nWhen you are on the brink of death, you can regain X units of health (X being the number of allegiances still in play). After which you must flip your character card.\n"
    },
    {
        "name": "Guān Xìng & Zhāng Bāo 关兴 & 张苞",
        "url": "http://sanguoshaenglish.blogspot.com/2012/06/guan-xing-zhang-bao.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/-yI5t1_HRq5M/T-ad5rog1CI/AAAAAAAABak/qg-W_0PdM8Y/s1600/guanxingzhangbao.png",
        "abilityText": "Character Ability: Spirit of their Fathers 父魂 (fù hún)\nIn the drawing phase, you can forfeit the drawing of cards and, instead, display the top two cards from the deck, then receive them. If the two cards displayed are of different colours, you receive the abilities \"Warrior Saint 武圣\" and \"Berserk 咆哮\" till the end of your turn.\n(Recall:\n\"Warrior Saint 武圣\"\nEvery card with a \"heart\" or \"diamonds\" suit (effectively all red-suit cards) can be used as an ATTACK 杀 card.\n\"Berserk 咆哮\"\nYou can use as many ATTACK 杀 cards as you wish during your turn.)\n"
    },
    {
        "name": "Zhang Fei 张飞 (*SP005)",
        "url": "http://sanguoshaenglish.blogspot.com/2012/05/zhang-fei-sp005.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/-PTn9XHSD5qA/UTsi3cMkoVI/AAAAAAAAB6s/TitoWLm9x9Q/s1600/0b886051.jpg",
        "abilityText": "Character ability 1: \"Indignation 嫉恶 (jí è)\" [Enforced ability]\nWhen you use red-suited ATTACK 杀 cards, the damage caused is +1.\nCharacter ability 2: \"Battle Cry 大喝 (dà hè)\"\nDuring your action phase, you can pick a player to points duel. If you win, all DODGE 闪 cards of that player that are not hearts-suit become ineffective till the end of the turn. You can pass the points duel card of that player to any player whose health is not more than yours. If you lose, you must display your hand of cards and select one card to discard. Limited to once per turn.\n"
    },
    {
        "name": "Liú Beì 刘备 (*SP007)",
        "url": "http://sanguoshaenglish.blogspot.com/2012/08/liu-bei-sp007.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/-unntsaQ_axE/UB3uTrPj0yI/AAAAAAAABdw/xeH_mdShBig/s1600/spliubei.jpg",
        "abilityText": "Character ability 1: Shining Martyr 昭烈 (zhāo liè)\nDuring your drawing phase, you can draw 1 card less, then ask a player within your attacking range to display the top 3 cards from the deck. Discard the non-Basic cards and PEACH 桃 amongst these 3 cards, (the remaining basic cards will be needed below).\nThe player must choose 1 out of the following 2 options:\n1. You inflict X units of damage on that player. The player then gets to acquire the remaining basic cards.\n2. The player discards X number of cards, and you acquire the remaining basic cards.\n(X is the number of non-Basic cards discarded amongst the 3 cards displayed.)\nCharacter ability 2: Oath of Vengeance 誓仇 (shì choú) [Ruler Ability] [Single-use Ability]\nAt the beginning of your turn, you can select 1 player from the Shu allegiance and give him 2 cards. Every instance you receive damage throughout the game, this other player will receive the same amount of damage on your behalf, then this player will draw as many cards as damage received. This ability will perpetuate until this player enters brink of death for the first time.\n"
    },
    {
        "name": "Cáo Cāo 曹操",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/cao-cao.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TFdvdaBYYMI/AAAAAAAAAFc/WrOCG8kXq3k/s1600/weicaocao.jpg",
        "abilityText": "Character ability 1: \"Villainous Hero 奸雄 (jiān xióng)\"\nYou can immediately acquire the card (or cards) that resulted in you suffering damage.\nHere are some examples of how that works:\nExample 1 - When he is the target of ATTACK 杀, Cao Cao can choose not use DODGE 闪, suffer the 1 unit of damage, and acquire the ATTACK card that was used.\nExample 2 - When he is recipient of fire damage that has been transmitted via\nIRON SHACKLES 铁索连环\n, he receives the card that caused the fire damage even though he was not the initial target.\n[Edited 28th Jan 2011] Example 3 (complex scenario) - When he uses DODGE to evade an ATTACK but the attacker has equipped\nStone Cleaving Axe 贯石斧\nand chooses to discard 2 cards to cause damage anyways, Cao Cao suffers the damage but cannot pick up BOTH of the cards that were discarded to cause the damage. This is because the card that causes the damage is the ATTACK and not the discarded cards. Contrast this to the\nSerpent Halberd 丈八蛇矛\n, where the 2 cards used in that instance represents an ATTACK card, and thus Cao Cao can pick up both of those cards if he suffers damage.\nCharacter ability 2: [Ruler ability] \"Royal Escort 护驾 (hù jià)\"\nYou can ask any Wei character 魏将 to use DODGE on your behalf where applicable.\n"
    },
    {
        "name": "Guō Jiā 郭嘉",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/guo-jia.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TFttQRdsShI/AAAAAAAAAIU/XvhgVHcicLE/s1600/weiguojia.jpg",
        "abilityText": "Character ability 1: \"Envy of Heaven 天妒 (tiān dù)\"\nYou can obtain any judgement card that you flip over.\n(For example, every time he undergoes judgement for\nLIGHTNING 闪电\nduring his turn, he can keep the judgement card that he flipped over. However if he uses ATTACK 杀 on a player that equipped\nEIGHT TRIGRAMS 八卦阵\n, Guo Jia cannot keep the judgement card for judgement of EIGHT TRIGRAMS because that card would be flipped over by the target player and not himself.)\nCharacter ability 2: \"Bequeathed Strategy 遗计 (yí jì)\"\nFor every 1 unit of damage that you receive, you can draw 2 cards from the deck. You can then choose to give away one, two, or none of these 2 cards to any player.\n"
    },
    {
        "name": "Sī Mǎ Yì 司马懿",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/si-ma-yi.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TFttVyw6ViI/AAAAAAAAAIc/kaoSzy2xdL8/s1600/weisimayi.jpg",
        "abilityText": "Character ability 1: \"Retaliation 反馈 (fǎn kuì)\"\nWhen you receive any damage, you can obtain 1 card (whether on-hand or equipped) from the player who is the source of the damage.\n(In most cases, source of damage is the player who is currently in the action phase (that player's turn) that played an offensive move. This is true even if the damage was transmitted through\nIRON SHACKLES 铁索连环\n, or deflected of another character such as\nXiao Qiao 小乔's\n\"Heavenly Scent 天香\" ability.)\nCharacter ability 2: \"Demonic Talent 鬼才 (guǐ cái)\"\nAfter any judgement card has been flipped over, you can immediately play one of your on-hand cards to replace the judgement card.\n(Note that Si Ma Yi cannot take back the original judgement card. Net effect is Si Ma Yi loses one on-hand card to change the judgement card.)\n"
    },
    {
        "name": "Xià Hóu Dūn 夏侯惇",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/xia-hou-dun.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/_cZXVdsBvjyM/TGFZtQxbe-I/AAAAAAAAAJk/q6inebFlv8s/s1600/weixiahoudun.jpg",
        "abilityText": "Character ability: \"An Eye for an Eye 刚烈 (gāng liè)\"\nEvery instance you suffer damage, you can flip a judgement card. If the judgement is not the suit of \"hearts\", the source player that caused the damage can choose 1 of 2 options.\nOption 1: Lose 1 unit of health\nOption 2: Discard any 2 on-hand cards\n"
    },
    {
        "name": "Xǔ Chǔ 许褚",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/xu-chu.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TGS9Z0fpopI/AAAAAAAAAJ8/AhvtqK26CRg/s1600/weixuzhu.jpg",
        "abilityText": "Character ability: \"Bare-Chested 裸衣 (luǒ yī)\"\nYou can choose to draw 1 card less in your drawing phase. If you to do so, any ATTACK 杀 and\nDUEL 决斗\nthat you use in the action phase results in 1 additional unit of damage to your opponent.\n(Note that if Xu Chu loses the DUEL, he only needs lose 1 unit. But if he wins, the victim loses 2 units.)\n"
    },
    {
        "name": "Zhāng Liáo 张辽",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/zhang-liao.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/_cZXVdsBvjyM/TGS9eumcIWI/AAAAAAAAAKE/DCp3cM2Q_4E/s1600/weizhangliao.jpg",
        "abilityText": "Character ability: \"Sudden Strike 突击 (tū jī)\"\nIn your drawing phase, you can choose to forgo drawing cards from the deck and, instead, draw 1 on-hand card from other players. Maximum 2 players (2 cards nett intake), minimum 1 player (1 card nett intake).\n(Note that Zhang Liao cannot mix \"Sudden Raid\" with drawing from the deck (ie: he cannot draw one card from the deck and one card from a player). Also note that since this ability is effective in the drawing phase, this ability cannot be used if he falls victim to\nRATIONS DEPLETED 兵粮寸断\n.)\n"
    },
    {
        "name": "Zhēn Jī 甄姬",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/zhen-ji.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TGS9jzm9kQI/AAAAAAAAAKM/de6VvAdIsvk/s1600/weizhenji.jpg",
        "abilityText": "Character ability 1: \"Impetus for War 倾国 (qīng guó)\"\nEvery one of your on-hand card that is a \"club\" or a \"spade\" suit can be used as DODGE 闪.\nCharacter ability 2: \"Goddess Luo 洛神 (luò shén)\"\nAt the beginning of your turn, you can flip a judgement card. If the judgement card is a black-suited card (\"clubs\" or \"spades\"), you can keep the card as an on-hand card and can continue to flip over another judgement card. Once the judgement card is red-suited card, the ability ends and you cannot keep that red-suited card.\n(Important note: This ability takes precedence BEFORE the judgement of time-delay tool cards (such as\nLIGHTNING\n).\nIt is perfectly possible for Zhen Ji to amass over 10 cards in a row using this ability, provided it is a string of consecutive black-suited cards. It is also perfectly possible to amass none at all if the very first card is red-suited.\nNote that after the ability ends, Zhen Ji can still draw 2 more cards from the deck as per normal. (Yes she will have a shit load of cards if she's lucky!)\n"
    },
    {
        "name": "Diǎn Wěi 典韦",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/dian-wei.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/_cZXVdsBvjyM/TFkXRvMoKDI/AAAAAAAAAHM/A7RWdem3hgc/s1600/weidianwei.jpg",
        "abilityText": "Character ability: \"Ferocious Assault 强袭 (qiáng xí)\"\nDuring the action phase of your turn, you can inflict 1 unit of damage to any player within your attacking range by either 1 of these 2 actions:\n1. Reducing 1 unit of your own health, or\n2. Discarding 1 \"weapon card 武器牌\" (can be on-hand or currently equipped)\nLimited to one use per turn.\nAbility's relation to story:\nThis ability, in my opinion, is related to the circumstances that killed Dian Wei. His enemies knew that Dian Wei is feared because of his dual halberds. Just prior to the attack, a defector stole his pair of halberds while Dian Wei was sleeping. When Dian Wei awoke during the chaos, he found his halberds missing but fought on with his bare hands anyway. Dian Wei then grabbed enemy soldiers and swung them about like batons, using the enemy themselves as weapons. However, Dian Wei was still wounded and slowly bled to death, all the while fighting like a mad man and killing many before he took his last breath. Therefore I see a connection between \"discarding a weapon card\" and his halberds getting stolen. There is also less direct link between \"reducing 1 unit of health\" and his fight to the death.\nAdditional info based on story:\n1. Most famous achievement - Ironically, his famed strength and his nickname \"E Lai of ancient times\" comes from one singular event that was not battle-related at all. It was when\nCao Cao\nfirst met Dian Wei that Cao Cao asked to see what he could do, sort of like an \"interview\". Dian Wei saw a huge banner that was toppling in strong winds. An whole crowd of soldiers could not keep the banner upright in that wind. Dian Wei grab the banner and held it upright and steady with only one-hand. It was then that Cao Cao exclaimed \"You are the E Lai of ancient times\".\n2. Cause of death - Cao Cao wanted to take the widow of Zhang Ji 张济 as his concubine. Zhang Ji's distant nephew, Zhang Xiu 张秀, was pissed. Knowing this, Cao Cao plotted to kill Zhang Xiu, but Zhang Xiu threw a surprise attack instead on Cao Cao. This battle is known as the battle of Wan Cheg 宛城之战 and it was where Dian Wei was killed (as mentioned under \""
    },
    {
        "name": "Xún Yù 荀彧",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/xun-yu.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/_cZXVdsBvjyM/TGFc-QLQNNI/AAAAAAAAAJ0/5gp2fAcvBpw/s1600/weixunyu.jpg",
        "abilityText": "Character ability 1: \"Rouse the Tiger 驱虎 (qū hǔ)\"\nIn your action phase, you can choose to\n\"Points Duel\"\nwith another character with more health than you. If your score is higher, that player will cause 1 unit to damage to another player within his/her attacking range\nof your choice\n. If your score is lower, that player will cause 1 unit of damage to you.\n(Note that the ultimate victim who suffers the damage cannot use DODGE 闪. It is immediate damage, not an ATTACK 杀. Usage is limited to once per turn.)\nCharacter ability 2: \"Eternal Loyalty 节命 (jié mìng)\"\nEvery 1 unit of damage that you suffer, you can allow any player of your choice (including yourself) to replenish that player's on-hand cards to the maximum health level.\n(Which means if\nLiu Bei 刘备\nonly has 1 card and 2 units of life left but his maximum health is 4 units, Liu Bei can draw 3 cards if Xun Yu uses \"Eternal Loyalty\" on him. Liu Bei's current health level is of no significance.)\n"
    },
    {
        "name": "Cáo Rén 曹仁",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/cao-ren.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/_cZXVdsBvjyM/TFkXI3IqZ1I/AAAAAAAAAHE/k8jvPAT2boY/s1600/weicaoren.jpg",
        "abilityText": "Character ability: \"Entrenched 据守 (jù shǒu)\n\"\nAfter the discard phase of your turn, you can draw an additional 3 cards from the deck. By doing so, you will skip your next turn.\n(Skip your turn meaning no judgement, no drawing of cards, no using of any cards, nothing what-so-ever!)\n"
    },
    {
        "name": "Xià Hóu Yuān 夏侯渊",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/xia-hou-yuan.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/_cZXVdsBvjyM/TGFbM9B7yTI/AAAAAAAAAJs/svrHKWhL1WM/s1600/weixiahouyuan.jpg",
        "abilityText": "Character ability: \"Godspeed 神速 (shén sù)\"\nYou can use either or both of the following options listed below. When any of the options below are activated, it is equivalent to using an ATTACK 杀 card on any player (no distance limitations).\n1. Skip your judgement phase as well as drawing phase.\n2. Skip your action phase as well as discard one equipment card.\n(This means he can no longer use any other card in his turn. Note that this option can only be used once a turn, regardless of how many equipment cards you have.)\nNote: Using this ability does NOT count as having used an ATTACK card. Which means to say if Godspeed option 1 is used, the player can continue to use an ATTACK card during the action phase. Both the options can be used consecutively in one turn, thus skipping judgement, drawing and action phase whilst being able to ATTACK twice.\n"
    },
    {
        "name": "Cáo Pī 曹丕",
        "url": "http://sanguoshaenglish.blogspot.com/2010/09/cao-pi.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/_cZXVdsBvjyM/TH8Y8LHiwwI/AAAAAAAAAYk/qxt2GrNggWQ/s1600/weicaopi.jpg",
        "abilityText": "Character ability 1: \"Unnatural Death 行殇 (xíng shāng)\"\nYou can immediately take possession of all the cards (both on-hand and equipped) of any player that dies.\nCharacter ability 2: \"Banish into Exile 放逐 (fàng zhú)\"\nEverytime you suffer damage, you can force any player (except yourself) to draw X number of cards. X being the units of health you have lost (measured from your max health level) after the damage has been taken into account. By doing so, this player will have to\n\"Flip Character Card\"\n(please click on link for more info).\nCharacter ability 3: [Ruler ability] \"Exalt the Powerful 颂威 (sǒng wēi)\"\nWhenever any Wei Character (other than yourself) makes a judgement, if the judgement card that takes effect is the suit of \"clubs\" or \"spades\", that character can choose to let you draw 1 card from the deck.\n"
    },
    {
        "name": "Xú Huǎng 徐晃",
        "url": "http://sanguoshaenglish.blogspot.com/2010/09/xu-huang.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TH0P4ymIcrI/AAAAAAAAAW0/msIMshezR7A/s1600/weixuhuang.jpg",
        "abilityText": "Character ability: \"Blockade 断粮 (duàn liáng)\"\nDuring the action phase, you can choose to use any of your Basic Cards or Equipment Cards with the suit of \"clubs\" or \"spades\" as\nRATIONS DEPLETED 兵粮寸断\n. Your range for RATIONS DEPLETED is extended to physical distance of 2.\nNote that the ability does not include Tool Cards, therefore black-suited Tool Cards cannot be used as RATIONS DEPLETED (unless it is the tool card itself is RATIONS DEPLETED).\n"
    },
    {
        "name": "Cáo Zhí 曹植",
        "url": "http://sanguoshaenglish.blogspot.com/2011/06/cao-zhi.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/-KtcX67iZ8zo/TeY3p_AOd6I/AAAAAAAAA1k/qJ2Di4Xn3Vs/s1600/caozhi.jpg",
        "abilityText": "Character ability 1: \"Falling Bloom 落英 (luò yīng)\"\nWhen other players discard or flip judgement cards with \"clubs\" into the discard pile, you can take possession of these cards.\nCharacter ability 2: \"Drunken Quatrain 酒诗 (jiǔ shī)\"\nWhen your character card is facing up, you can choose to flip over your character card and this will be considered as having used WINE 酒 (under reasonable situations only).\nWhen you suffer damage while your character card is facing down, you can choose to flip over your character card such that is faces up after the damage you received is concluded.\n"
    },
    {
        "name": "Yú Jìn 于禁",
        "url": "http://sanguoshaenglish.blogspot.com/2011/06/yu-jin.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/-U9gEaMhsMYw/TeY3_Rg01aI/AAAAAAAAA2I/dywa6OfgPWQ/s1600/yujin.jpg",
        "abilityText": "Character ability: Resolute 毅重 (yì zhòng) [Enforced ability]\nWhen you have no armor equipped, black-suited ATTACK 杀 cards have no effect on you.\n"
    },
    {
        "name": "Zhāng Chūn Huá 张春华",
        "url": "http://sanguoshaenglish.blogspot.com/2011/06/zhang-chun-hua.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/-SMWbQD05wwc/TeY4BUZ58hI/AAAAAAAAA2M/eInv_alj8tI/s1600/zhangchunhua.jpg",
        "abilityText": "Character ability 1: \"Ruthless 绝情 (jué qíng)\" [Enforced ability]\nAll damage caused by you is viewed as \"loss of health\". (Character abilities or card abilities that are activated when damage is \"caused by\" or \"received\" will not activate).\nCharacter ability 2: \"Bereavement 伤逝 (shāng shī)\"\nWith the exception of the discard phase, whenever your number of on-hand cards is less than the number of units of health loss thus far, you can immediately draw from the deck till your on-hand cards equal number of units of health loss.\nExample of usage for \"Bereavement\" - When you have 1 unit of health left, the number of health loss thus far is 2 units. Suppose you have 2 on-hand cards, a WINE 酒 and an ATTACK 杀, and you use both simultaneously on another player, you will have zero on-hand cards left. You can thus immediately draw 2 cards from the deck.\n[2012 New version]\nCharacter ability 1: \"Ruthless 绝情 (jué qíng)\" [Enforced ability]\nAll damage you are about to inflict is converted to \"loss of health\".\nCharacter ability 2: \"Bereavement 伤逝 (shāng shī)\" [Enforced ability]\nWith the exception of the discard phase, your minimum number of on-hand cards is X, X being the number of units of health you have loss and X has a maximum of 2.\n"
    },
    {
        "name": "Dèng Ài 邓艾",
        "url": "http://sanguoshaenglish.blogspot.com/2011/08/deng-ai.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/-LekAo_oCC8U/TkKbgMOMv_I/AAAAAAAAA3o/0mSrViWl1EU/s1600/dengai.jpg",
        "abilityText": "Character ability 1: \"Amassing Terrain 屯田 (tún tián)\"\nEvery instance that you lose card(s) (on-hand or equipped) outside your turn, you can flip a judgement card. If the judgement is not the suit of \"hearts\", you can put the judgement card (referred to as \"Terrain\") atop your character card. Every \"Terrain\" that you amass, your physical distance to other players decreases by -1.\n(Trivia: 屯田 is the agricultural policy practiced by Cao Cao, sending soldiers and refugees to distant lands, so as to boost the economy and provide supplies to the military. The actual meaning of 屯田 can be translated as \"Growing Wheat\", \"Agricultural strategies\" or simply \"Cultivation\")\nCharacter ability 2: \"Conduit 凿险 (záo xiǎn)\" [Awakening Ability]\nAt the beginning of your turn, if you have more than or equal to 3 \"Terrains\", you must reduce your maximum health by 1 unit. You will  then permanently acquire the ability \"Blitz 急袭\" (In the action phase, you can use any of your \"Terrains\" as STEAL 顺手牵羊)\n"
    },
    {
        "name": "Zhāng Hé 张郃",
        "url": "http://sanguoshaenglish.blogspot.com/2011/08/zhang-he.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/-2iDjoliAmzk/TkKbnupK9-I/AAAAAAAAA3w/bEtmd5q1UJQ/s1600/zhanghe.jpg",
        "abilityText": "Character ability: “Flexibility 巧变 (qiǎo biàn)”\nYou can discard one one-hand card to skip one of your phases (excluding beginning phase and ending phase).\nIf you skip your drawing phase using this method, you draw 1 on-hand card from a maximum of two other players.\nIf you skip your action phase using this method, you can relocate a card (in the equipment area or in the pending judgement area) from its original location to another identical location.\n(e.g. relocating a weapon from Player A’s equipment area to Player B’s equipment area, or relocating the ACEDIA that is pending judgement from Player A’s pending area to Player B’s pending area).\n"
    },
    {
        "name": "Yáng Xiū 杨修 (SP001)",
        "url": "http://sanguoshaenglish.blogspot.com/2011/10/translated-description-genius.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/-4JQAjKj2_1I/Tp7CiQ-A4RI/AAAAAAAAA50/7pvYJRVk-pI/s1600/spyangxiu.jpg",
        "abilityText": "Character ability 1: Have your Cake (and eat it) 啖酪 (dàn lào)\nWhen you are targeted by a tool card that also affects other players, you can immediately draw a card. If you do so, that tool card has no effect on you.\nCharacter ability 2: The Wishing Bone 鸡肋 (jī lèi)\nWhenever you receive damage, you can voice out a card type (basic cards, tool cards or equipment cards). The player that caused you damage can no longer use, play, or discard any on-hand cards of that type until the end of that round.\n"
    },
    {
        "name": "Guān Yǔ 关羽 (SP007)",
        "url": "http://sanguoshaenglish.blogspot.com/2011/11/guan-yu-sp.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/-HDfuVxk9Z_4/Tp7CXpfWxkI/AAAAAAAAA5M/crG_kMbZb9w/s1600/spguanyu.jpg",
        "abilityText": "Character ability1: “Warrior Saint 武圣 (wǔ shèng)”\nEvery card with a “heart” or “diamonds” suit (effectively all red-suit cards) can be used as an ATTACK 杀card.\nCharacter ability2: “Single Calvary 单骑(dān qí)” [Awakening ability]\nAt the beginning of your turn, if your number of on-hand cards is larger than your current health units, AND the RULER for the game is Cao Cao, you must reduce your maximum health by 1 unit. You then permanently acquire the ability “Horsemanship 马术”\n(Recall: Horsemanship 马术 = You will always have -1 distance in range calculations).\n"
    },
    {
        "name": "Páng Dé 庞德 (SP006)",
        "url": "http://sanguoshaenglish.blogspot.com/2011/11/pang-de-sp006.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/-Y-Dg_s2KE9w/Tp7Ceu8jh2I/AAAAAAAAA5k/Vo7Pq85ZnQc/s1600/sppangde.jpg",
        "abilityText": "Character ability1: “Horsemanship 马术 (mǎ shù)”\nYou will always have a -1 distance advantage (default “-1 horse” equipped)\nCharacter ability2: “Fearsome Advance 猛进 (měng jìn)”\nWhenever your ATTACK 杀 is evaded by DODGE 闪, you can forcefully discard one of the opponents cards (on-hand or equipped). Note that you select the card for discarding and not the opponent.\n"
    },
    {
        "name": "Cài Wén Jī (Lady Cai) 蔡文姬 (SP009)",
        "url": "http://sanguoshaenglish.blogspot.com/2011/12/cai-wen-ji-lady-cai-sp009.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/-eWFrw5SylRM/TuC0g1uF-HI/AAAAAAAABIM/fFPxNZCc6d0/s1600/spcaiwenji.jpg",
        "abilityText": "Character ability1: “Dirge 悲歌 (bēi gē)”\nEvery instance a player suffers damage from an ATTACK, you can discard a card (on-hand or equipped), and the player who suffered the damage flips a judgement card.\nIf the judgement is “hearts”, the victim regains 1 unit of health.\nIf the judgement is “diamonds”, the victim draws 2 cards.\nIf the judgement is “clubs”, the attacker discards 2 cards.\nIf the judgement is “spades”, the attacker flips his/her character card over.\nCharacter ability2: “Sorrow 断肠(duàn cháng)” [Enforced ability]\nThe player who kills you loses all of his/her character abilities until the end of the game.\n"
    },
    {
        "name": "Jia Xu 贾诩 (SP012)",
        "url": "http://sanguoshaenglish.blogspot.com/2012/01/jia-xu-sp012.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/-hHdg8eV68_Y/Tw_xyZsUDKI/AAAAAAAABSs/xFdXjgJMu9c/s1600/spjiaxu.jpg",
        "abilityText": "Character ability 1: “Unmitigated Murder 完杀 (wán shā)”\n[Enforced ability]\nDuring your turn, with the exception of yourself, only characters who are on the brink of death (health equals zero or less) can use PEACH 桃.\nCharacter ability 2: “Descend into Chaos 乱武 (luàn wǔ)”\n[Single-Use Ability]\nDuring your action phase, your can force every player, other than yourself, to use an ATTACK 杀 on another player at the least distance away. If a player is unable to do so (no ATTACK cards to use or attack range cannot reach any player), the player will lose 1 unit of health. Recipients of the ATTACK need to use DODGE 闪 to evade. This ability will proceed in succession starting from the player on your right.\nCharacter ability 3: “Behind the Curtain 帷幕 (wéi mù)”\n[Enforced ability]\nYou cannot become the target of tool cards with the suit of \"clubs\" or \"spades\".\n"
    },
    {
        "name": "Xún Yoū 荀攸",
        "url": "http://sanguoshaenglish.blogspot.com/2012/05/xun-you.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/-__iFhPtFlnQ/T64ypiYFO4I/AAAAAAAABYw/zY6MdWljFk8/s1600/xunyou.png",
        "abilityText": "Character ability 1: Contrivance 奇策 (qí cè)\nIn the action phase, you can use all your on-hand cards (minimum of one) as any one non-time-delay tool card. Limited to once per turn.\nCharacter ability 2: Playing Dumb 智愚 (zhì yú)\nEvery instance after you receive damage, you can draw a card, then display all your on-hand cards. If all your on-hand cards are of the same colour, the source of your damage must discard one on-hand card.\n"
    },
    {
        "name": "Cáo Zhāng 曹彰",
        "url": "http://sanguoshaenglish.blogspot.com/2012/05/cao-zhang.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/--q457jZyAWg/T7RAZ4xZGhI/AAAAAAAABY8/gtLIgEEDzQM/s1600/caozhang.jpg",
        "abilityText": "Character ability: Versatile Fighter 将驰\nDuring the drawing phase, you can choose 1 of 2 options.\n1. Draw 1 extra card. If you do so, you cannot use or play any ATTACK 杀 cards until your turn is over.\n2. Draw 1 card less. If you do so, any ATTACK cards used during your action phase has unlimited range. You can also use 1 more ATTACK card in that turn. Effects last till your turn is over.\n"
    },
    {
        "name": "Wáng Yì 王异",
        "url": "http://sanguoshaenglish.blogspot.com/2012/05/wang-yi.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/-PDZmAAIZo5E/T7ht_yYkGBI/AAAAAAAABZI/QF0l1kXad2s/s1600/wangyi.jpg",
        "abilityText": "Character ability 1: Death over Desecration 贞烈 (zhēn liè)\nBefore your judgement card takes effect, you can display the top card of the deck and use it as a substitute.\nCharacter ability 2: Hatch a Plan 秘计 (mì jì)\nIf you are injured before the beginning (or ending) phase of your turn, you can flip a judgement card. If the judgement card is black-suited, you can view X cards from the top of the deck (X being units of health lost), then give these cards to a player.\n"
    },
    {
        "name": "Zhōng Huì 钟会",
        "url": "http://sanguoshaenglish.blogspot.com/2012/08/zhong-hui.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/-NUfjz_lwiuw/UBswogmCNeI/AAAAAAAABdc/RcxEeU419AQ/s1600/zhonghui.png",
        "abilityText": "Character ability 1: Amassing Power 权计 (quán jì)\nAfter you receive 1 unit damage, you can draw 1 card, then place 1 on-hand card on your character card. This card will be known as a \"Power\" card. Every \"Power\" card you have on your character card, your on-hand card limit increases by +1.\n(Note: \"Power\" cards are viewed as being removed from play.)\nCharacter ability 2: Uprising 自立 (zì lì) [Awakening ability]\nAt the beginning of your turn, if you have 3 or more \"Power\" cards, you must reduce 1 unit of your maximum health limit, then either regain 1 unit of health or draw 2 cards.\nYou also acquire the ability \"Eradicate 排异\".\n(In the action phase, you can discard 1 \"Power\" card and allow any player to draw 2 cards. After drawing 2 cards, if that player has more on-hand cards than you, you inflict 1 unit of damage on that player. Limited to once per phase.)\n"
    },
    {
        "name": "Cao Ren 曹仁 (*SP003)",
        "url": "http://sanguoshaenglish.blogspot.com/2012/04/cao-ren-sp003.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/-9X8JhMcw3mE/T5PHnkiq3MI/AAAAAAAABYM/VzMQALG4QIQ/s1600/cao+ren+front.jpg",
        "abilityText": "Character ability 1: \"Break Out 溃围 (kuì wéi)\"\nAt the Ending phase of your turn, you may draw 2 + X cards, then flip your character card over. If you do so, you must discard X cards at the beginning of your next drawing phase. X is the total number of weapon cards in all the equipped areas of all characters.\nCharacter ability 2: \"Discipline 严整 (yán zhěng)\"\nIf the number of your on-hand cards is larger than your health, you may use any of your equipped cards as NEGATE 无懈可击.\n"
    },
    {
        "name": "Sīmǎ Zhāo 司马昭 (Sticker Add-on)",
        "url": "http://sanguoshaenglish.blogspot.sg/2012/08/sima-zhao-sticker-add-on.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/-0KKY4wlDoOQ/UCw7Fb4N7kI/AAAAAAAABeY/e-YT4doi7AI/s1600/spsimazhao.png",
        "abilityText": "Character ability 1: \"Obvious Intentions 昭心 (zhāo xīn)\"\nAt the end of your drawing phase, you can immediately display all your on-hand cards. This is seen as having used ATTACK 杀 on a player within your attacking range. Limited to once per phase.\nCharacter ability 2: \"Cautious Wolf 狼顾 (láng gù)\"\nWhenever you sustain 1 unit of damage, you can flip a judgement card and you can replace this judgement card with any of your on-hand cards. Then, inspect the on-hand cards of the player that is the source of your damage. You can discard any of his/her cards with the same suit as the judgement card.\n"
    },
    {
        "name": "Wáng Yuánjī 王元姬 (Sticker Add-on)",
        "url": "http://sanguoshaenglish.blogspot.com/2012/08/wang-yuanji-sticker-add-on.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/-cj8E2fUIqrE/UDnPcVvs--I/AAAAAAAABg4/zOB5vcYsmfw/s1600/wangyuanji.jpg",
        "abilityText": "Character ability 1: \"Smother 扶亂 (fú luàn)\"\nDuring your action phase, you can discard 3 cards of the same suit to flip the character card of a player within your attacking range. If you do so, you cannot use ATTACK 杀 in your turn. Limited to one use per phase.\nCharacter ability 2: \"Virtuous 淑德 (shū dé)\"\nAt the ending phase, you can draw cards such that your number of on-hand cards is equal to your health limit.\n"
    },
    {
        "name": "Xiàhoù Dūn 夏侯惇 (*SP010)",
        "url": "http://sanguoshaenglish.blogspot.sg/2013/04/xiahou-dun-sp010.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/-xUZSIKN8nuE/UVqGySFiZ2I/AAAAAAAACHk/BH0wliUT_v0/s1600/Slide3.JPG",
        "abilityText": "Character ability 1: \"Ferocious Courage 愤勇 (fèn yǒng)\"\nEvery instance you receive damage, you can rotate your health card such that it is vertical. When your health card is vertical, you prevent all damage that you receive.\nCharacter ability 2: \"Vengeance is mine 雪恨 (xuě hèn)\"\nDuring the Ending phase of every player, if your health card is vertical, you must rotate it back to horizontal, then choose one of the following options.\n1. Discard X cards from the player who's turn is ending (X is the units of health you have lost thus far)\n2. Regarded as using one ATTACK 杀 on any player.\n"
    },
    {
        "name": "Sūn Quán 孙权",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/sun-quan.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/08/wusunquan.jpg",
        "abilityText": "Character ability 1: \"Balance of Power 制衡 (zhì héng)\"\nDuring your action phase, you can discard any number of cards (both on-hand or equipped) and draw the same number of new cards from the deck. Limited to once per turn.\nCharacter ability 2: [Ruler ability] [Enforced ability] \"Rescued 救援 (jiù yuán)\"\nWhen you are rescued from the brink of death by other Wu characters via the use of\nPEACH 桃\n, you recover 1 additional unit of health (from zero health to two units of health).\n"
    },
    {
        "name": "Dà Qiáo 大乔",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/da-qiao.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/08/wudaqiao.jpg",
        "abilityText": "Character ability 1: \"National Colours 国色 (guó sè)\"\nDuring your action phase, you can choose to use any card (both on-hand or equipped) with a \"diamond\" suit as\nACEDIA 乐不思蜀\n.\nCharacter ability 2: \"Displacement 流离 (liú lí)\"\nWhenever you become the target of ATTACK 杀, you can discard any card and divert the ATTACK to a player within your attacking range. This player cannot be the original player that used the ATTACK card.\n"
    },
    {
        "name": "Gān Níng 甘宁",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/gan-ning.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/08/wuganning.jpg",
        "abilityText": "Character ability: \"Surprise Raid 奇袭 (qí xí)\"\nDuring your action phase, you can choose to use any of your cards (both on-hand and equipped) with \"clubs\" and \"spades\" suit as\nDISMANTLE 过河拆桥\n.\n"
    },
    {
        "name": "Huáng Gài 黄盖",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/huang-gai.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/08/wuhuanggai.jpg",
        "abilityText": "Character ability: \"Trojan Flesh 苦肉 (kǔ ròu)\"\nDuring your action phase, you can choose to lose 1 unit of health and draw 2 more cards from the deck. This ability can be used repeatedly in a turn.\n"
    },
    {
        "name": "Lǚ Méng 吕蒙",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/lu-meng.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/08/wulumeng.jpg",
        "abilityText": "Character ability: \"Self-Mastery 克己 (kè jǐ)\"\nIf you did not use any ATTACK 杀 cards during your action phase, you can skip the discard phase.\n(This means he need not discard any cards despite having more cards than he has health units. Note that the use of ATTACK outside of his turn (such as in response to\nBARBARIANS 南蛮入侵\n) does not require him to discard his cards either.)\n"
    },
    {
        "name": "Lù Xùn 陆逊",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/lu-xun.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/08/wuluxun.jpg",
        "abilityText": "Character ability 1: [Enforced ability] \"Humility 谦逊 (qiān xùn)\"\nYou cannot become the target of\nSTEAL 顺手牵羊\nand\nACEDIA 乐不思蜀\n.\nNote that this is different from those tools being \"ineffective\". Lu Xun simply cannot be targeted at all for these two tools. Therefore if you accidentally used these cards on Lu Xun, take it back into your hand and use it on someone else. Do not discard them since you are not considered to have even used them at all.\nCharacter ability 2: \"One after another 连营 (lián yíng)\"\nWhenever you lose or use your last on-hand card, you can immediately draw one card from the deck.\n(This means Lu Xun will always have at least one card on hand at all times.)\n"
    },
    {
        "name": "Sūn Shàng Xiāng 孙尚香",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/sun-shang-xiang.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/08/wusunshangxiang.jpg",
        "abilityText": "Character ability 1: \"Marriage 结姻 (jié yīn)\"\nDuring your action phase, you can choose to discard 2 on-hand cards and pick any male character that is not at full-health. By doing so, both the male character and yourself will recover 1 unit of health each. Limited to only 1 use per turn.\nCharacter ability 2: \"Warrior Lady 枭姬 (xiāo jī)\"\nWhenever any equipped card is removed from your equipped items area, you can immediately draw 2 cards from the deck.\n(Note that 2 cards can be drawn for each equipped card that is removed. This applies also to changing the equipped item (ie: replacing one weapon with another weapon).\n"
    },
    {
        "name": "Zhōu Yú 周瑜",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/zhou-yu.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/08/wuzhouyu.jpg",
        "abilityText": "Character ability 1: \"Dashing Hero 英姿 (yīng zī)\"\nYou can draw 1 additional card during your drawing phase.\n(This means he can draw 3 cards from the deck instead of 2 at every turn.)\nCharacter ability 2: \"Sow Dissension 反间 (fǎn jiàn)\"\nDuring the action phase, you can ask any one player to guess a suit (eg: hearts, diamonds, clubs or spades). This player while then have to pick one of your  on-hand cards and show it to everyone. If the selected card has the same suit as that which the player guessed, nothing happens. If it is not the same suit, the player loses one unit of health. Regardless of the result, the player will always get to keep that card which he or she picked. Limited to one use per turn.\nDisambiguation:\n1. Can a player refuse or use\nNEGATE 无懈可击\nwhen \"Sow Dissension\" is directed at him or her?\nAns: No. There is no escaping this ability! The player targeted MUST pick one of Zhou Yu's on-hand cards and keep it.\n2. What if the target player only has 1 unit of health left and guessed the wrong suit, but the card picked happens to be\nPEACH 桃\nor\nWINE 酒\n? Can this card be used to save himself or herself?\n[Updated Feb 2011]\nAns: No. The player must be saved from the brink of death first before being able to take possession of the card.\n3. What if the player targeted is using\nXiao Qiao\nand she guesses \"hearts\", but picked a \"spades\" card? Does her ability \"Youthful Beauty\" apply such that the \"spade\" becomes viewed as a \"heart\"?\nAns: Yes her ability applies. Thus if Xiao Qiao picks \"hearts\", she has a far higher chance of escaping damage since both \"spades\" and \"hearts\" will save her. This may have been a planned consequence by the game makers since Xiao Qiao and Zhou Yu are a couple.\n"
    },
    {
        "name": "Tài Shǐ Cí 太史慈",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/tai-shi-ci.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/08/wutaishici.jpg",
        "abilityText": "Character ability: \"Justice of Heaven 天义 (tiān yì)\"\nDuring your action phase, you can conduct Points Duel 拼点 with any other character. Limited to one use per turn.\nIf you win the Points Duel -\n1. You will have unlimited attacking range\n2. You can use 1 additional ATTACK 杀 card in that turn\n3. Each ATTACK can target 1 additional character.\nIf you lose the Points Duel, you cannot use ATTACK till the end of that turn.\n"
    },
    {
        "name": "Xiǎo Qiáo 小乔",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/xiao-qiao.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/08/wuxiaoqiao.jpg",
        "abilityText": "Character ability 1: \"Heavenly Scent 天香 (tiān xiāng)\"\nWhenever you receive any damage, you can choose to pass the damage on to any other player by discarding an on-hand card that has a suit of \"hearts\". The victim that receives the damage gets to draw X number of cards from the deck, X being the total amount of health loss (measured from the character's maximum health level) after the deflection.\n(Xiao Qiao is left unscathed once the damage is passed to another player. For example, Xiao Qiao receives 2 units of damage and she discards ONE on-hand card of \"hearts\" suit to pass the damage on to\nZhang Fei 张飞\n(who currently has 2 units of health left with a maximum health of 4). Zhang Fei loses 2 units of health due to damage passed by Xiao Qiao, however he does not get to draw 4 cards (Max health = 4, subtract current health = 0, equals 4 cards to draw) until he has been rescued from the brink of death.)\nCharacter ability 2: [Enforced ability] \"Youthful Beauty 红颜 (hóng yán)\"\nYou will always regard all cards with a suit of \"spades\" as the suit of \"hearts\".\nThis effectively means that her \"Heavenly Scent\" ability will also work if she discards a \"spade\" since it is regarded as a \"heart\". This also means that\nLIGHTNING\nwill NEVER strike her since she is the one that conducts the judgement for LIGHTNING and it requires \"spades\" to strike. An additional bonus is that she has a stronger chance of overcoming\nACEDIA\nsince judgement card of \"spades\" will equal to \"hearts\".\n"
    },
    {
        "name": "Zhōu Tài 周泰",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/zhou-tai.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/08/wuzhoutai.jpg",
        "abilityText": "Character ability: \"Refuting Death 不屈 (bù qū)\"\nWhen your health reaches zero (brink of death), one playing card must be flipped from the deck and placed on your character card. You not considered dead at this point and the game continues. Whenever you lose an additional unit of health from here on, an additional card will be further added on top of your character card. As long as none of these cards have the same \"number\" (ie: from ace to king), you will remain alive. Whenever there is a card or more placed on your character card, you will always be considered as being on the \"brink of death\".\nDisambiguation:\n1. Can the card displayed after Zhou Tai's health reaches zero be \"tinkered\" with by\nSi Ma Yi 司马懿\nor\nZhang Jiao 张角\n?\nAns: No. It is not a judgement card and cannot be changed by these 2 characters.\n[Added Feb 2011]\n2. Can other players use\nPEACH 桃\non Zhou Tai when he has \"brink-of-death\" cards displayed?\nAns: Only under specific circumstances. Other players can only use PEACH on Zhou Tai when:\n(a) When Zhou Tai receives damage\n(b) Right after a \"brink-of-death\" card is flipped.\n3. What happens when another \"brink-of-death\" card has a number that matches one of the other cards already displayed?\n[Updated Feb 2011]\nAns: Zhou Tai DOES NOT die immediately. Instead the other players have the option of using PEACH to save him, or he can use\nPEACH\nor\nWINE 酒\n. Once saved, the most recent \"brink-of-death\" card can be discarded.\n[Added Feb 2011] 4\n. Can Zhou Tai use PEACH or WINE in his turn to remove \"brink-of-death\" cards, even though he did not receive damage?\nAns: Yes.\n5. What is the largest number of health units that Zhou Tai can have in total before he dies?\nAns: 16!! 3 units of health deducted the normal way plus a possible 13 different cards can be displayed without any repeating number.\n"
    },
    {
        "name": "Sūn Jiān 孙坚",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/sun-jian.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/09/wusunjian.jpg",
        "abilityText": "Character ability: \"Lingering Spirit 英魂 (yīng hún)\"\nIn the beginning of every turn, you can carry out either of the options listed below if you are not at maximum health (X represents the number of units of health you have lost thus far). Pick one other player to carry out one of the following options:\n1. Draw X cards, then discard 1 card.\n2. Draw 1 card, then discard X cards.\nLimited to one use per turn.\n"
    },
    {
        "name": "Lǔ Sù 鲁肃",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/lu-su.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2010/09/wulusu.jpg",
        "abilityText": "Character ability 1: \"Altruism 好施 (hào shī)\"\nIn the drawing phase, you can choose to draw 2 more cards (total of 4 cards). If you have more than 5 on-hand cards as a result, you must give half of your on-hand cards (rounded down to a whole number) to the player with the least amount of on-hand cards (excluding yourself).\nCharacter ability 2: \"Alliance 缔盟 (dì méng)\"\nDuring your action phase, you can choose to force 2 players (other than yourself) to exchange their entire set of on-hand cards by discarding X number of cards, X being the difference between the number of on-hand cards between these 2 players. Limited to one use per turn.\n"
    },
    {
        "name": "Líng Tǒng 凌统",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/ling-tong.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2011/06/lingtong.jpg",
        "abilityText": "Character ability: Tempest 旋风 (xuán fēng)\nWhenever a card is removed from your equipped items area, you can carry out either 1 of the following 2 options:\n1. Viewed as having used an ATTACK 杀 on any player (this ATTACK will not be considered in calculating the number of ATTACK card used per turn).\n2. Cause 1 unit of damage to a player within physical range of 1.\n[2012 New version]\nCharacter ability: Tempest 旋风 (xuán fēng)\nEach instance that you lose equipped cards, or you discard 2 or more cards in your discard phase, you can discard a total of 2 cards (\none card at a time)\nfrom up to maximum of 2 players.\n(Note: Total of 2 cards means either discard 2 cards from 1 player, or 1 card each from 2 players.)\n"
    },
    {
        "name": "Wú Guó Tài (Lady Wu) 吴国太",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/wu-guo-tai-lady-wu.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2011/07/wuguotai.jpg",
        "abilityText": "Character ability 1: Heavenly Essence 甘露 (gān lù)\nIn the action phase, you can choose 2 players to exchange all of their equipped cards. The\ndifference\nin the number of equipped cards between the 2 players must not be more than X, where X is the amount of health you have\nlost\nthus far. Limited to once per turn.\nCharacter ability 2: Ameliorate 补益 (bǔ yì)\nWhen a player is at the brink of death, you can display one of the on-hand cards of that player. If that card is\nnot\na basic card, the player will discard that card and regain 1 unit of health.\n(Basic cards are ATTACK 杀 (any type), DODGE 闪, PEACH 桃, or WINE 酒)\n"
    },
    {
        "name": "Xú Shèng 徐盛",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/xu-sheng.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2011/07/xusheng.jpg",
        "abilityText": "Character ability: Annihilate 破军 (pò jūn)\nWhenever your ATTACK 杀 causes damage, you can force your victim to draw X cards from the deck (X being the number of health units the victim currently has. X has a maximum of 5), after which the victim must flip his or her character card over.\n"
    },
    {
        "name": "Zhāng Zhāo & Zhāng Hóng 张昭&张纮",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/zhang-zhao-zhang-hong.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2011/08/zhangzhao.jpg",
        "abilityText": "Character ability 1: \"Blunt advice 直谏 (zhí jiàn)\"\nIn the action phase, you can put an on-hand equipment card in the equipped card area of another character (you cannot replace an equipment already equipped). If you do so, you can draw a card.\nCharacter ability 2: \"Stabilization 固政 (gù zhèng)\"\nAt the end of other players’ discard phase, you can return a card that was discarded in this phase to the player. If you do so, you can take the other cards discarded in this phase as your own on-hand cards.\n"
    },
    {
        "name": "Sūn Cè 孙策",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/sun-ce.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2011/08/sunce.jpg",
        "abilityText": "Character ability 1: \"Ardor 激昂 (jī áng)\"\nWhenever you use (or become the target of) DUEL 决斗 or a red-suited ATTACK 杀, you can draw a card.\nCharacter ability 2: \"Divine Aura 魂姿 (hún zī)\" [Awakening ability]\nAt the beginning of your turn, if your health is 1 unit, you must reduce your maximum health by 1 unit. You then permanently acquire the abilities \"Dashing Hero 英姿\" and \"Lingering Spirit 英魂\".\n(Note: \"Dashing Hero\" is Zhou Yu 周瑜's ability that allows him to draw 3 cards. \"Linering Spirit\" is Sun Jian's ability \"Draw X discard 1\" or \"Draw 1 discard X\".)\nCharacter ability 3: \"Hegemony 制霸 (zhì bà)\" [Ruler ability]\nDuring the action phase of other Wu characters, they can choose to “Points Duel” once with you. If they do not win the “Points Duel”, you can take the cards used in “Points Duel” from both parties. After your Awakening ability activates, you can refuse the \"Points Duel\".\n"
    },
    {
        "name": "Bù Liànshī 步练师",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/bu-lianshi.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2012/06/bulianshi.png",
        "abilityText": "Character ability 1: Pacify 安恤 (ān xù)\nIn the action phase, you can choose 2 players (other than yourself) with different number of on-hand cards. The player with less on-hand cards will acquire 1 card from the other player, and display it to all players. If that card is not the suit of Spades, you can draw 1 card from the deck. Limited to once per turn.\nCharacter ability 2: In Loving Memory 追忆 (zhuī yì)\nWhen you die, you can choose one player (other than yourself and the player who killed you) to draw 3 cards and regain 1 unit of health.\n"
    },
    {
        "name": "Hàn Dāng 韩当",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/han-dang.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2012/07/handang.jpg",
        "abilityText": "Character Ability 1: Mounted Archer 弓骑 (gōng jì)\nYou can use or play one equipment card as an ATTACK 杀 card. The ATTACK used via this ability has no distance limitations.\nCharacter Ability 2: Resolver of Troubles解烦 (jiě fán)\nWhen any player is at the brink of death, you can use an ATTACK on the player whose turn it currently is. If this ATTACK causes damage, you prevent the damage and is instead viewed as having used PEACH 桃 on the player at the brink of death.\n"
    },
    {
        "name": "Chéng Pǔ 程普",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/cheng-pu.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2012/07/chengpu.png",
        "abilityText": "Character Ability 1: Toxic Pyre 疠火 (lì huǒ)\nYou can use 1 normal ATTACK 杀 as FIRE ATTACK 火杀. If this FIRE ATTACK causes damage, you lose 1 unit of health after all damage calculations has been concluded. When you use FIRE ATTACK, you can select 1 additional target player.\nCharacter Ability 2: Superior Vintage 醇醪 (chún láo)\nWhen the ending phase of your turn begins, if there are no cards on your character card, you can place any number of ATTACK cards on your character card (these cards are referred to as \"VINTAGE\"). When a player is on the brink on death, you can discard a VINTAGE card and this is viewed as the player having used WINE 酒.\n"
    },
    {
        "name": "Lǖ Méng 吕蒙 (*SP006)",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/lu-meng-sp006_6.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2012/07/sp006lvmeng.jpg",
        "abilityText": "Character ability 1: \"Taunt the Tiger 探虎\"\nDuring the action phase,  you can conduct Points Duel with another player. If you win, you acquire the following abilities till the end of your turn.\n1. Your distance from that player is 1.\n2. Non-Time Delay Tool cards used on that player cannot be neutralized by NEGATE 无懈可击.\nLimited to once per phase.\nCharacter ability 2: \"Strategic Judgement 谋断\" [Transformation ability]\nUnder normal circumstances, your token should have \"Warrior 武\" facing up and you possess the abilities \"Ardor 激昂\" and \"Humility 谦逊\".\nWhen your number of on-hand cards is 2 or less, you must flip your token over such that \"Strategist 文\" is facing up, and change those 2 abilities into \"Dashing Hero 英姿\" and \"Self Mastery 克己\". You can flip the token over by discarding a card before the start of any player's turn.\n(Note:\nHumility 谦逊 (qiān xùn) (Lu Xun 陆逊's ability)\nYou cannot become the target of STEAL 顺手牵羊 and ACEDIA 乐不思蜀.\nArdor 激昂 (jī áng) (Sun Ce 孙策's ability)\nWhenever you use (or become the target of) DUEL 决斗 or a red-suited ATTACK 杀, you can draw a card.)\nDashing Hero 英姿 (yīng zī) (Zhou Yu 周瑜's ability)\nYou can draw 1 additional card during your drawing phase.\nSelf-Mastery 克己 (kè jǐ) (Lu Meng's ability)\nIf you do not use any ATTACK 杀 cards during your action phase, you can skip the discard phase.)\n"
    },
    {
        "name": "Dà Qiáo 大乔 (*SP008)",
        "url": "http://sanguoshaenglish.blogspot.com/2013/03/da-qiao-sp008_6.html",
        "demi-god": false,
        "imgUrl": "http://sanguoshaenglish.files.wordpress.com/2012/08/spdaqiao.png",
        "abilityText": "Character ability 1: \"Gentle Smile 言笑 (yán xiào)\"\nDuring the action phase, you can place a card with suit of Diamonds in the judgement area of any player. Players with \"Gentle Smile\" in their judgement area gets to keep all the judgement cards during that player's judgement phase.\nCharacter ability 2: \"Quiet Elegance 安娴 (ān xián)\"\nWhenever you cause damage when you use an ATTACK 杀, you can prevent that damage and force the victim to discard 1 on-hand card, after which you draw 1 card from the deck.\nWhenever you become the target of an ATTACK, you can discard 1 on-hand card to render the ATTACK useless, after which your attacker draws 1 card from the deck.\n"
    },
    {
        "name": "Diāo Chán 貂蝉",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/diao-chan.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/_cZXVdsBvjyM/THhbYhygFPI/AAAAAAAAAUk/LvftQ7wc6Ik/s1600/qundiaochan.jpg",
        "abilityText": "Character ability 1: \"Seed of Animosity 离间 (lí jiān)\"\nDuring your action phase, you can discard one card (either on-hand or equipped) and select two male characters to undergo\nDUEL 决斗\nwith each other. This ability cannot be neutralized using\nNEGATE 无懈可击\n. Limited to one use per turn.\nNote that Diao Chan must select one of the male characters to be the first to use ATTACK 杀 on the other male character. If this first character does not or is unable to use ATTACK, he will suffer 1 unit of damage and the ability ends (the other male character need not use ATTACK).\nCharacter ability 2: \"Envious Moon 闭月 (bì yuè)\"\nIn the end of your turn, you can draw one additional card from the deck.\n"
    },
    {
        "name": "Huà Tuó 华佗",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/hua-tuo.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/_cZXVdsBvjyM/THhb4iVf0KI/AAAAAAAAAUs/q0kg4kp8BwA/s1600/qunhuotuo.jpg",
        "abilityText": "Character ability 1: \"Emergency Rescue 急救 (jí jiù)\"\nOutside of your turn, you can use any of your cards (on-hand or equipped) with the suit of \"hearts\" or \"diamonds\" as\nPEACH 桃\n.\nCharacter ability 2: \"Green Salve 青囊 (qīng náng)\"\nDuring your action phase, you can discard one on-hand card and allow any player to regain 1 unit of health. Limited to one use per turn.\n"
    },
    {
        "name": "Lǚ Bù 吕布",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/lu-bu.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/_cZXVdsBvjyM/THhcioGY0bI/AAAAAAAAAU0/tewro39zX1w/s1600/qunlubu.jpg",
        "abilityText": "Character ability: [Enforced ability] \"Without Equal 无双 (wú shuāng)\"\nWhenever you use ATTACK 杀, your target has to use 2 DODGE 闪 cards to successfully evade the attack. During a\nDUEL 决斗\n, your opponent needs to use 2 ATTACK cards for every one ATTACK card that you use.\n"
    },
    {
        "name": "Yuán Shào 袁绍",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/yuan-shao.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/_cZXVdsBvjyM/THhagsuNgDI/AAAAAAAAAUU/2RGlLw6iuGU/s1600/qunyuanshao.jpg",
        "abilityText": "Character ability 1: \"Chaos Strike 乱击 (luàn jī)\"\nDuring your action phase, you can choose to discard any 2 on-hand cards with the same suit as\nRAINING ARROWS 万箭齐发\n.\nCharacter ability 2: [Ruler ability] [Enforced ability] \"Bloodline 血裔 (xuè yì)\"\nYour limit for on-hand cards at the end of your turn increases by 2 for every one Heroes 群雄 character (other than yourself) still in play.\n"
    },
    {
        "name": "Páng Dé 庞德",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/pang-de.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/_cZXVdsBvjyM/THhc4Jo6j8I/AAAAAAAAAU8/IE1epYYPvFU/s1600/qunpangde.jpg",
        "abilityText": "Character ability 1: [Enforced ability] \"Horsemanship 马术 (mǎ shù)\"\nYou will always have a -1 distance advantage (default \"-1 horse\" equipped).\nCharacter ability 2: \"Fearsome Advance 猛进 (měng jìn)\"\nWhenever your ATTACK 杀 is evaded by DODGE 闪, you can discard one of your opponent's cards (on-hand or equipped).\nNote that Pang De selects the card for discarding and not the opponent.\n"
    },
    {
        "name": "Yán Liáng & Wén Chǒu 颜良文丑",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/yan-liang-wen-chou.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/_cZXVdsBvjyM/THhdWyl0J0I/AAAAAAAAAVE/wuQijVeTphk/s1600/qunyanliangwenchou.jpg",
        "abilityText": "Character ability: \"Dual Heroes 双雄 (shuāng xióng)\"\nDuring the drawing phase, you can choose to forfeit the drawing phase and opt for a judgement card to be flipped. Unlike usual judgement cards, this particular judgement card can be kept into your hand. Note the colour of the suit (black or red) of this judgement card. For the rest of your action phase, you can choose to use any on-hand card with a different colour from this judgement card as\nDUEL 决斗\n.\n"
    },
    {
        "name": "Zhāng Jiǎo 张角",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/zhang-jiao.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/_cZXVdsBvjyM/THha4Q9mEfI/AAAAAAAAAUc/L2VnWu3Kr70/s1600/qunzhangjiao.jpg",
        "abilityText": "Character ability 1: \"Lightning Strike 雷击 (léi jī)\"\nWhenever you use a DODGE 闪 card, you can target any player to make a judgement. If the judgement card is of the \"spades\" suit, the target player suffers 2 units of lightning attribute damage.\nCharacter ability 2: \"Dark Sorcery 鬼道 (gǔi dào)\"\nYou can exchange the judgement card of any player before it takes effect with any of his \"spades\" or \"clubs\" suit cards (on-hand or equipped).\n(Note that the cards are exchanged, meaning Zhang Jiao can retrieve the original judgement card back into his hand.)\nCharacter ability 3: [Ruler ability] \"Amber Sky 黄天 (huáng tiān)\"\nAll Heroes 群雄 characters can give you one DODGE or\nLIGHTNING 闪电\ncard during their individual turns.\n"
    },
    {
        "name": "Yú Jí 于吉",
        "url": "http://sanguoshaenglish.blogspot.com/2010/08/yu-ji.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/_cZXVdsBvjyM/THhd9Vjek1I/AAAAAAAAAVM/GMIsoueIUzw/s1600/qunyuji.jpg",
        "abilityText": "Character ability: \"Bewilder 盅惑 (zhōng huò)\"\nWhenever you use a Basic Card (like ATTACK 杀,\nPEACH 桃\netc.) or Non-Time-Delay Tool cards (such as\nDISMANTLE 过河拆桥\n,\nNEGATE 无懈可击\netc.), you can verbalize the intended card but play the card faced down on the table. If nobody doubts the authenticity of the card, the card takes the effect as verbalized. If there is (are) any player(s) that doubt the authenticity of the card, the card must be flipped over to expose the true identity of the card.\n- If the card is real, every player that expressed doubted will lose 1 unit of health.\n- If the card is a fake, every player that expressed doubt gets to draw 1 card from the deck.\nRegardless whether the card is real or fake, the card is rendered useless as long as it has been flipped over UNLESS the card is both real and has a suit of \"hearts\", in which case the card still is effective.\n"
    },
    {
        "name": "Dǒng Zhuó 董卓",
        "url": "http://sanguoshaenglish.blogspot.com/2010/09/dong-zhuo.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/_cZXVdsBvjyM/TH0ODGkMhCI/AAAAAAAAAWc/yaDlXjz8_uU/s1600/qundongzhuo.jpg",
        "abilityText": "Character ability 1: \"Drown in Wine 酒池 (jiǔ chí)\"\nYou can use any of your on-hand cards with a suit of \"spades\" as\nWINE 酒\n.\nCharacter ability 2: [Enforced ability] \"Garden of Lust 肉林 (ròu lín)\"\nWhen you use ATTACK 杀 on a female character and vice versa, the targeted character needs to use 2 DODGE 闪 cards to successfully evade the attack.\nCharacter ability 3: [Enforced ability] \"Disintegrate 崩坏 (bēng huài)\"\nAt the end of every turn, if your health is not the least or amongst the least, you must lose 1 unit of health or reduce his maximum health by 1 unit.\nCharacter ability 4: [Ruler ability] \"The Tyrant 暴虐 (bào nüè)\"\nWhen other Heroes 群雄 characters cause any damage to other players, you can flip a judgement card. If the judgement card is the suit of \"spades\", Dong Zhuo will regain 1 unit of health.\n"
    },
    {
        "name": "Jiǎ Xǔ 贾诩",
        "url": "http://sanguoshaenglish.blogspot.com/2010/09/jia-xu.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TH0RJjYV7UI/AAAAAAAAAXM/rVrPvjHiCug/s1600/weijiaxu.jpg",
        "abilityText": "Character ability 1: [Enforced ability] \"Unmitigated Murder 完杀 (wán shā)\"\nDuring your turn, with the exception of yourself, only characters who are on the brink of death (health equals zero or less) can use\nPEACH 桃\n.\nCharacter ability 2: [Single-Use Ability] \"Descend into Chaos 乱武 (luàn wǔ)\"\nDuring your action phase, you can force every player, other than yourself, to use an ATTACK 杀 on another player at the least distance away. If a player is unable to do so (no ATTACK cards to use or attack range cannot reach any player), the player will lose 1 unit of health. Recipients of the ATTACK need to use DODGE 闪 to evade. This ability will proceed in succession starting from the player on your right.\nCharacter ability 3: [Enforced ability] \"Behind the Curtain 帷幕 (wéi mù)\"\nYou cannot become the target of tool cards with the suit of \"clubs\" or \"spades\".\n"
    },
    {
        "name": "Gāo Shùn 高顺",
        "url": "http://sanguoshaenglish.blogspot.com/2011/07/gao-shun.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/-8T2ZLBwHzRc/TeY3xEw7-6I/AAAAAAAAA1w/GFAI7ZSeC-k/s1600/gaoshun.jpg",
        "abilityText": "Character ability 1: Ambush 陷阵 (xiàn zhèn)\nDuring your action phase, you can Points Duel with another player.\nIf you win, you possess the following abilities till your turn ends.\n- Disregard any distance between you and that player\n- Disregard any equipped armor of that player.\n- You can use as many ATTACK 杀 cards as you wish on that player.\nIf you lose, you cannot use any ATTACK cards for the remainder of this turn.\nLimited to one use per turn.\nCharacter ability 2: Abnegation 禁酒 (jìn jiǔ) [Enfored ability]\nAll your WINE 酒 cards must be regarded as ATTACK cards.\n"
    },
    {
        "name": "Chén Gōng 陈宫",
        "url": "http://sanguoshaenglish.blogspot.com/2011/07/chen-gong.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/-F4hWurf0jxU/TeY3sJEaYUI/AAAAAAAAA1o/iNLh9_bfDZ8/s1600/chengong.jpg",
        "abilityText": "Character ability 1: Brilliant Scheme 明策 (míng cè)\nDuring your action phase, you can give an equipment card or an ATTACK 杀 card to any other player (the recipient). The recipient must then choose between 1 of 2 options.\n1. This action would be viewed as having used an ATTACK on another player of your choice within the recipient's attacking range.\n2. Draw a card from the deck.\nLimited to one use per turn.\nCharacter ability 2: Cerebral Delay 智迟 (zhī chí) [Enforced ability]\nWhenever you receive damage during another player's turn, any ATTACK or Tool cards (except Time-delayed tool cards) have no effect on you until that turn ends.\n"
    },
    {
        "name": "Cài Wén Jī (Lady Cai) 蔡文姬",
        "url": "http://sanguoshaenglish.blogspot.com/2011/08/cai-wen-ji-lady-cai.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/-LMExWsbWSrs/TkKbyIzOCdI/AAAAAAAAA4A/OoZ2WJkWIyA/s1600/caiwenji.jpg",
        "abilityText": "Character ability 1: \"Dirge 悲歌 (bēi gē)\"\nEvery instance a player suffers damage from an ATTACK, you can discard a card (on-hand or equipped), and the player who suffered the damage flips a judgement card.\nIf the judgement is \"hearts\", the victim regains 1 unit of health.\nIf the judgement is \"diamonds\", the victim draws 2 cards.\nIf the judgement is \"clubs\", the attacker discards 2 cards.\nIf the judgement is \"spades\", the attacker flips his/her character card over.\nCharacter ability 2: \"Sorrow 断肠 (duan chang)\" [Enforced ability]\nThe player who kills you loses all of his/her character abilities until the end of the game.\n"
    },
    {
        "name": "Zuǒ Cí 左慈",
        "url": "http://sanguoshaenglish.blogspot.com/2011/08/zuo-ci.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/-aYDzKL1g0SY/TkKbciNgI0I/AAAAAAAAA3k/umXj68ckyLM/s1600/zuoci.jpg",
        "abilityText": "Character ability 1: \"Shapeshift 化身 (huà shēn)\"\nAfter everyone has selected their character cards, you select two unused character cards randomly from the deck. Select one of these two characters and place it before you, then state one of that character's abilities (excluding Single-use ability, awakening ability and ruler ability). You will obtain the stated ability, the allegiance, and the gender of this character until you have replaced it. At the beginning and end of each turn, you can replace the character with another character and/or re-state another ability.\nCharacter ability 2: \"Germinate 新生 (xīn shēng)\"\nFor every 1 unit of damage you receive, you can acquire another new character card for \"Shapeshift\".\n"
    },
    {
        "name": "Diāo Chán 貂蝉 (SP002)",
        "url": "http://sanguoshaenglish.blogspot.com/2011/10/diao-chan-sp.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/-U6NzGqGBaSg/Tp7CUeztaLI/AAAAAAAAA48/4-BZfLaRFUE/s1600/spdiaochan.jpg",
        "abilityText": "Character ability 1: \"Seed of Animosity 离间 (lí jiān)\"\nDuring your action phase, you can discard one card (either on-hand or equipped) and select two male characters to undergo DUEL 决斗 with each other. This ability cannot be neutralized using NEGATE 无懈可击. Limited to one use per turn.\nCharacter ability 2: \"Envious Moon 闭月 (bì yuè)\"\nAt the end of your turn (after the discard phase), you  can draw one additional card from the deck.\n"
    },
    {
        "name": "Gōngsūn Zàn 公孙瓒 (SP003)",
        "url": "http://sanguoshaenglish.blogspot.com/2011/11/gongsun-zan.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/-KCEHM71hLW8/Tp7CWDx61zI/AAAAAAAAA5E/_hvL81z9ifI/s1600/spgongsunzhan.jpg",
        "abilityText": "Character ability: “Righteous Cavalry 义从 (yì cóng)” [Enforced ability]\nWhen your health is more than 2 units, you have -1 distance in any range calculations. When your health is equal or less than 2 units, you have +1 distance in any range calculations.\n"
    },
    {
        "name": "Yuán Shù 袁术 (SP004)",
        "url": "http://sanguoshaenglish.blogspot.com/2011/11/yuan-shu.html",
        "demi-god": false,
        "imgUrl": "http://4.bp.blogspot.com/-1UslUfgRykw/Tp7CkZDFREI/AAAAAAAAA58/1Qc97jJ2XPs/s1600/spyuanshu.jpg",
        "abilityText": "Character ability 1: “Mediocrity 庸肆 (yōng sì)” [Enforced ability]\nDuring your drawing phase, you draw an extra X cards, X being the total number of allegiances still in play. During your discard phase, you must discard at least as many cards as there are allegiances still in play. If you have less cards than there are allegiances, you must discard all of them.\nNote: Allegiance here refers to Shu, Wei, Wu, or Heroes.\nCharacter ability 2: “The Pseudo-Emperor 偽帝 (wěi dì)”\n[Enforced ability]\nYou possess the ruler ability of the current ruler.\nAbility Tips:\n1. X, in Yuan Shu’s case, does NOT mean the total amount of players, but number of Allegiance. For example, before your drawing phase starts there are Shu, Wei, Wu and Heroes characters alive, you draw 6 cards (X = 4, so additional 4 cards on top of your normal 2 cards).\n2. During your discard phase, if there’s only a Shu, Wei and Heroes left in the game (3 allegiances), you must discard at least 3 cards, BUT you must also discard any number of cards in order to keep your hand equal to or less than your current health units. You can choose to discard your equipped cards.\n3. Example: During your discard phase there are 3 allegiances in play, you have 2 equipped cards and 5 on-hand cards, and you have 3 units of health. You can choose to discard your 2 equipped and 1 of your on-hand cards (to match the ability constraint of 3 cards discarded), but you’ll still need to throw away one more card because your total on-hand cards is higher than your current health. Or, you can keep your equipped cards and throw away 3 on-hand cards, reducing your number of on-hand cards to below your current health and complying with the constraint of your ability. Any mix of discarded equipped and on-hand cards is possible, as long as it obeys both the specific ability rule and the game’s general rule.\n4. Another example: During your discard phase you have 1 card on-hand and 1 equipped, and there are 3 allegiances left in the game. You need to discard both your cards, which means you would have absolutely NOTHING left.\n5. Yuan Shu doesn’t have any RULER ability! (The frame of his card is white, not yellow as the other characters that have ruler abilities.) “The Pseudo-Emperor” is just his ability. If the current ruler has no ruler ability, or you choose Yuan Shu as the ruler, you would have only his first ability. And in any case, you would always be considered as a neutral hero.\n6.The ruler ability you have would be exactly the same as the current ruler. For example, the current ruler is Cao Cao 曹操, you can use “Royal Escort 护驾”, which means you can ask any Wei character, including Cao Cao himself, to use DODGE 闪on your behalf when applicable.\n"
    },
    {
        "name": "Mǎ Chāo 马超 (SP011)",
        "url": "http://sanguoshaenglish.blogspot.com/2012/03/ma-chao-sp011.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/-NXaJ-uQVjJw/T1ipuUOsK8I/AAAAAAAABVk/jd0GYF7YuGs/s1600/sp+machao.jpg",
        "abilityText": "Character ability1: “Horsemanship 马术 (mǎ shù)” [Enforced ability]\nYou will always be -1 distance in any range calculations.\nCharacter ability2: “Iron Calvary 铁骑(tiě jì)”\nWhenever you use ATTACK 杀 on any target player, you can choose to flip over one judgement card from the deck. If the judgement card is of a red-suit (hearts and diamonds), the ATTACK cannot be evaded with DODGE闪.\n"
    },
    {
        "name": "Huá Xióng 华雄",
        "url": "http://sanguoshaenglish.blogspot.com/2012/07/hua-xiong.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/-6POEMVUVJFk/UAuEEBcHNqI/AAAAAAAABbw/NIyMaNCTdeM/s1600/huaxiong.jpg",
        "abilityText": "Character Ability 1: \"Reckless 恃勇(shi yǒng)\" [Enforced ability]\nEvery instance that you suffer damage from a red ATTACK 杀 or WINE ATTACK 酒杀, your maximum health limit is reduced by 1.\n"
    },
    {
        "name": "Liú Biǎo 刘表",
        "url": "http://sanguoshaenglish.blogspot.com/2012/07/liu-biao.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/-4e18COcCy-w/UAzFoy5ye2I/AAAAAAAABdE/Vz1vY-zrN0I/s1600/liubiao.png",
        "abilityText": "Character Ability 2:  \"House of Royalty 宗室 (zhōng shì)\" [Enforced ability]\nFor every allegiance still in play, your on-hand card limit is increased by +1.\n"
    },
    {
        "name": "Zhao Yun 赵云 (*SP001)",
        "url": "http://sanguoshaenglish.blogspot.com/2012/02/zhao-yun-sp001.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/-NG3qbqAdz9I/Ty_iG3wuMUI/AAAAAAAABTE/QAMejYbDVXo/s1600/2411471_01.jpg",
        "abilityText": "Character ability 1: \"Dragon Heart 龙胆 (lóng dǎn)\"\nAll ATTACK 杀 and DODGE 闪 cards can be used interchangeably.\nCharacter ability 2: \"Formation Piercer 冲阵 (chōng zhèn)\"\nWhenever you use or play an on-hand card to activate “Dragon Heart”, you can immediately take an on-hand card from the opponent.\nNote: \"Opponent\" here refers to either the player who caused you to activate \"Dragon Heart\" (the player that uses \"Raining Arrows 万箭齐发\"), or the person on the receiving end of \"Dragon Heart\" (you use DODGE as an ATTACK on that player).\n"
    },
    {
        "name": "Diao Chan 貂蝉 (*SP002)",
        "url": "http://sanguoshaenglish.blogspot.com/2012/03/diao-chan-sp002.html",
        "demi-god": false,
        "imgUrl": "http://2.bp.blogspot.com/-io8MGvNd0lY/T183dNnJxFI/AAAAAAAABYE/e1InhzX3FDI/s1600/diaochan2012_front.jpg",
        "abilityText": "Character Ability 1: Soul Surrender 离魂 (lí hún)\nIn the action phase, you can discard one card and flip over your character card. If you do so, you can acquire all the on-hand cards of one male character. At the end of the action phase, you must return that male character one card for every remaining health unit that he has.\nLimited to one use per turn.\nCharacter ability 2: Envious Moon 闭月 (bì yuè)\nAt the end of your turn, you can draw one card from the deck.\n"
    },
    {
        "name": "Pang Tong 庞统 (*SP004)",
        "url": "http://sanguoshaenglish.blogspot.com/2012/04/pang-tong-sp004.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/-oy4hcjnpEsY/T5abzOrpFwI/AAAAAAAABYc/MvMWT2h143Y/s1600/pangtong.jpg",
        "abilityText": "Character ability 1: \"To Hell with Work 漫卷 (màn juàn)\"\nWhenever you are about to receive a card, you\nmust\nplace that card in the discard pile. If this happens within your turn, you can pick up any one card with the same number (Ace to King) from the discard pile and place it in your on-hand cards.\n[Updated 25/04/2012]\nCharacter ability 2: \"Plastered 醉乡(zuì xiāng)\" [Single-Use ability]\nAt the beginning of your turn, you can flip over 3 cards from the top of the deck and place them on your character card. You cannot use or play any card of the same \"type\" (basic card, tool card, weapon card, etc.) as those placed on your character card. All cards of the same type also have no effect on you. For every turn henceforth, you must flip over another 3 cards and place them on your character card, until any 2 cards placed on your character card has the same number (Ace to King). When that happens, all the cards on your character card will go into your on-hand cards.\n"
    },
    {
        "name": "Gān Níng 甘宁 (*SP009)",
        "url": "http://sanguoshaenglish.blogspot.com/2012/09/gan-ning-sp009.html",
        "demi-god": false,
        "imgUrl": "http://1.bp.blogspot.com/-Lde50PBMO5o/UFJy0vMeNJI/AAAAAAAAByM/gOIKGegq4Ak/s1600/ganningsp.jpg",
        "abilityText": "Character ability 1: Silver Bells 银铃 (yín líng)\nDuring your action phase, you can discard 1 black-suited card and select another player. If you do so, you acquire 1 card from that player, then place that card on top of your character card. This card will then be known as ”Brocade 锦\". (Max number of Brocades = 4)\nCharacter ability 2: Militant's Might 军威 (jūn wēi)\nAt the end phase of your turn, you can discard 3 \"Brocades\" into the discard pile. If you do so, you must ask one player to choice between 1 of 2 options:\n1. Display 1 DODGE 闪 card, which you then take and pass to any player.\n2. Lose 1 unit of health, after which you select 1 card from that player's equipped items area and move that card out of the game. Once that player's turn has ended, that card that was moved out of the game shall be returned to its original position.\n"
    },
    {
        "name": "Demi-God Zhū Gě Liàng 神诸葛亮",
        "url": "http://sanguoshaenglish.blogspot.com/2010/09/demi-god-zhu-ge-liang.html",
        "demi-god": true,
        "imgUrl": "http://2.bp.blogspot.com/_cZXVdsBvjyM/TIGZyWNt1XI/AAAAAAAAAaE/kr0CoRZQtSE/s1600/shenzhuge.jpg",
        "abilityText": "Character ability 1: \"The Seven Stars 七星 (qī xīng)\"\nAt the very beginning of the game, when the initial 4 cards are being distributed amongst all players, you will be given a total of 11 cards. Pick 4 out of these 11 to be your starting hand, while the remaining cards are placed face down elsewhere (out of the game area). These extra cards will be referred to as \"Stars\". During your turn, right after the drawing phase, you can interchange any number of your on-hand cards with an identical number of your Stars.\nCharacter ability 2: \"Strong Gale 狂风 (kuáng fēng)\"\nAt the end of your turn, you can discard 1 of your \"Stars\" and select 1 target player. From then till your next turn, this target player will suffer 1 additional unit of damage for all fire attribute damage.\nCharacter ability 3: \"Heavy Shroud 大雾 (dà wù)\"\nAt the end of your turn, you can discard X number of \"Stars\" and select X number of target players. From then till your next turn, these target players will be protected from all damage except Lightning attribute damage.\n"
    },
    {
        "name": "Demi-God Zhōu Yú 神周瑜",
        "url": "http://sanguoshaenglish.blogspot.com/2010/09/demi-god-zhou-yu.html",
        "demi-god": true,
        "imgUrl": "http://2.bp.blogspot.com/_cZXVdsBvjyM/TIOb16-JgYI/AAAAAAAAAas/f96zYJ40W4U/s1600/shenzhouyu.jpg",
        "abilityText": "Character ability 1: \"The Sound of Music 琴音 (qín yīn)\"\nDuring your discard phase, when you discard 2 or more on-hand cards, you can choose to force all players (including yourself) to regain 1 unit of health or lose 1 unit of health.\nCharacter ability 2: [Single-Use ability] \"Searing Heat 业炎 (yè yán)\"\nDuring your action phase, you can select 1 to 3 players and distribute a total of 3 units of fire attribute damage between them. If you allocate 2 units or more of damage to any of the players, you need to discard 1 card of each suit (4 cards in total) and lose 3 units of health.\n"
    },
    {
        "name": "Demi-God Guān Yǔ 神关羽",
        "url": "http://sanguoshaenglish.blogspot.com/2010/09/demi-god-guan-yu.html",
        "demi-god": true,
        "imgUrl": "http://4.bp.blogspot.com/_cZXVdsBvjyM/TIGYl3GF_wI/AAAAAAAAAZs/CJgfc1W8S7g/s1600/shenguanyu.jpg",
        "abilityText": "Character ability 1: [Enforced ability] \"God of War 武神 (wǔ shén)\"\nEvery \"heart\" suited card will be regarded as ATTACK 杀. When you use one of these \"heart\" suited cards, the ATTACK has no range limitations.\nCharacter ability 2: [Enforced ability] \"Warrior Spirit 武魂 (wǔ hún)\"\nFor every 1 unit of damage that any player that inflicts on you, that player will receive 1 \"Nightmare 梦魇\" token. When you die, the player with the most number of Nightmare tokens must flip a judgement card. Unless the judgement card is\nPEACH 桃\nor\nPEACH GARDEN 桃园结义\n, that player dies immediately.\n"
    },
    {
        "name": "Demi-God Lǚ Méng 神吕蒙",
        "url": "http://sanguoshaenglish.blogspot.com/2010/09/demi-god-lu-meng.html",
        "demi-god": true,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TIGZUb8yLaI/AAAAAAAAAZ8/TBH-rjOnm4o/s1600/shenlumeng.jpg",
        "abilityText": "Character ability 1: \"Browse Through 涉猎 (shè liè)\"\nDuring your drawing phase, you can choose to carry out the following action to replace the drawing of cards: Flip over 5 cards from the top of the deck and take 1 card of each suit (max 4 cards: 1 heart, 1 spade, 1 clubs, 1 diamonds). Discard the remainder.\nCharacter ability 2: \"Strike at the Heart 攻心 (gōng xīn)\"\nDuring your action phase, you can view all the on-hand cards of 1 player. You can then pick 1 card with a suit of \"hearts\" from this player's on-hand cards and display it for every player to see. After doing so, you can choose to either discard this \"hearts\" card or place it at the top of the deck.\n"
    },
    {
        "name": "Demi-God Cáo Cāo 神曹操",
        "url": "http://sanguoshaenglish.blogspot.com/2010/09/demi-god-cao-cao.html",
        "demi-god": true,
        "imgUrl": "http://3.bp.blogspot.com/_cZXVdsBvjyM/TIGWyj7NG1I/AAAAAAAAAZk/GsLrS4lINk4/s1600/shencaocao.jpg",
        "abilityText": "Character ability 1: \"Homage 归心 (guī xīn)\"\nFor every 1 unit of damage that you receive, you can draw one card from every character in play (equipped cards, on-hand cards, or pending judgement cards). After doing so, you must\nflip character card\n.\nCharacter ability 2: [Enforced ability] \"Flying Shadow 飞影 (fēi yǐng)\"\nWhen other characters consider their distance from you, you will always have additional +1 distance away (equipped +1 horse by default).\n"
    },
    {
        "name": "Demi-God Lǚ Bù 神吕布",
        "url": "http://sanguoshaenglish.blogspot.com/2010/09/demi-god-lu-bu.html",
        "demi-god": true,
        "imgUrl": "http://1.bp.blogspot.com/_cZXVdsBvjyM/TIGY-6HyeoI/AAAAAAAAAZ0/idntsKBoqEI/s1600/shenlubu.jpg",
        "abilityText": "Character ability 1: [Enforced ability] \"Violent Rage 狂暴 (kuáng bào)\"\nAt the beginning of the game, you get 2 \"Rage 暴怒\" tokens. Every 1 unit of damage you cause or suffer, you receive 1 Rage token.\nCharacter ability 2: [Enforced ability] \"Simpleton 无谋 (wú móu)\"\nEvery time you use a tool card (with the exception of Time-delay Tool Cards), you must discard 1 Rage token or lose 1 unit of health.\nCharacter ability 3: \"Unprecedented 无前 (wú qián)\"\nDuring your action phase, you can discard 2 Rage tokens and select 1 target player. For the rest of your turn, the target player's Armour becomes ineffective. In addition, you acquires Lu Bu's\n\"Without Equal 无双\" ability\n.\nCharacter ability 4: \"Asura's Fury 神愤 (shén fèn)\"\nDuring your action phase, you can discard 6 Rage tokens. Every player (except yourself) will:\n(Carried out in order from 1 to 3)\n1. Receive 1 unit of damage\n2. Discard all equipped cards\n3. Discard 4 on-hand cards\nAfter this is done, you must flip your character card. Limited to once per turn.\n"
    },
    {
        "name": "Demi-God Sīmǎ Yì 神司马懿",
        "url": "http://sanguoshaenglish.blogspot.com/2011/08/demi-god-sima-yi.html",
        "demi-god": true,
        "imgUrl": "http://3.bp.blogspot.com/-fDkyPxuLUYU/TlpFLIdJvYI/AAAAAAAAA4U/rcdh5WN_v5w/s1600/shensimayi.jpg",
        "abilityText": "Character ability 1: \"Restraint 忍戒 (rěn jiè)\" [Enforced ability]\nFor every 1 unit of damage you receive or every 1 card you discard during your discard phase, you receive a “Restraint 忍” token.\nCharacter ability 2: \"Promotion 拜印 (bài yìn)\" [Awakening ability]\nAt the start of your turn, if you have 4 or more Restraint tokens, you must reduce your maximum health by 1 unit, and you permanently acquire the ability \"Extreme Tactic 极略\". (Discard a Restraint token to execute one of the following abilities: \"Demonic Talent 鬼才\", \"Banish into Exile 放逐\", \"Unmitigated Murder 完杀\", \"Balance of Power 制衡\" or \"Assembling Wisdom 集智\")\n(Recall:\nDemonic Talent (Sima Yi) - Change judgement card\nBanish into Exile (Cao Pi) - Flip character card\nUnmitigated murder (Jia Xu) - Peach can't save others\nBalance of Power (Sun Quan) - Change cards on-hand/equipped\nAssembling Wisdom (Huang Yueying) - Draw 1 card when use a Tool card)\nCharacter ability 3: \"Domino Victory 连破 (lián pò)\"\nIf you kill one or more players within your turn, once your turn ends, you get to play an extra turn.\n"
    },
    {
        "name": "Demi-God Zhào Yún 神赵云",
        "url": "http://sanguoshaenglish.blogspot.com/2011/08/demi-god-zhao-yun.html",
        "demi-god": true,
        "imgUrl": "http://1.bp.blogspot.com/-7kO3xN4NPfs/TlpFIj6nQ5I/AAAAAAAAA4Q/-Mg89GwdaTc/s1600/shenzhaoyun.jpg",
        "abilityText": "Character ability 1: \"Adversity 逆境 (nì jìng)\" [Enforced ability]\nDuring the drawing phase, the number of cards you draw is equal to the health you have lost thus far plus 2. Your on-hand card limit will always be +2 more than usual.\nCharacter ability 2: \"Soul of the Dragon 龙魂\"\nYou can use or play X cards with the same suit as the following:\n\"Hearts\" as \"PEACH 桃\"\n\"Diamonds\" as \"ATTACK 杀\" with fire attributes\n\"Clubs\" as \"DODGE 闪\"\n\"Spades\" as \"NEGATE 无懈可击\"\n(X is the units of health you have currently. X has a minimum of 1.)\n"
    },
    {
        "name": "Lǚ Bù 吕布 (SP008)",
        "url": "http://sanguoshaenglish.blogspot.com/2011/12/lu-bu-sp008.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/-6lSZ87pxPL0/Tp7Ccs9hjjI/AAAAAAAAA5c/Wl_pTvfVA3w/s1600/splubu8.jpg",
        "abilityText": "Character ability 1: “Horsemanship 马术 (mǎ shù)” [Enforced ability]\nYou will always be at -1 distance in any range calculations.\n(Note: Same ability as Ma Chao 马超)\nCharacter ability 2: “Without Equal 无双(wú shuāng)” [Enforced ability]\nWhenever you use ATTACK杀, your target has to use 2 DODGE 闪 cards to successfully evade the attack. During a DUEL 决斗, your opponent needs to use 2 ATTACK cards for every one ATTACK card that you use.\n(Note: Same ability as the original Lu Bu 吕布.)\nWhen your health decreases to 4 units, your character card has to be changed immediately into this next character card.\nTranslated Description:\n“The Furious God of Battle 暴怒的战神(bào nù de zhàn shén)”\nCharacter ability 1: “Horsemanship 马术 (mǎ shù)” [Enforced ability]\nYou will always be at -1 distance in any range calculation.\nCharacter ability 2: “Without Equal 无双(wú shuāng)” [Enforced ability]\nWhenever you use ATTACK杀, your target has to use 2 DODGE 闪cards to successfully evade the attack. During a DUEL 决斗, your opponent needs to use 2 ATTACK cards for every one ATTACK card that you use.\nCharacter ability 3: “Asura 修罗(xiū luó)”\nAt the beginning of your turn, you can discard one on-hand card in order to discard one Time- Delay Tool Card that is in your Judgement Area. The card you discard must be of the same suit as the Time-Delay Tool Card.\nCharacter ability 4: “Divine Aura 神威 (shén wēi)” [Enforced ability]\nDuring your drawing phase, you can draw an additional 2 cards. Your on-hand card limit is increased +2.\nCharacter ability 5: “Divine Halberd 神戟 (shén jǐ)”\nWhen you have no weapon equipped, your ATTACK card can target up to 3 different players.\nTip:\nThere are no LIGHTNING 闪电 cards and no expansions SO FAR in HuLao-Pass Mode on  SGS online. Since this character is designed for HuLao-Pass Mode, the Time- Delay Tool Cards would only refer to ACEDIA 乐不思蜀.\n"
    },
    {
        "name": "Lǚ Bù 吕布 (SP008)",
        "url": "http://sanguoshaenglish.blogspot.com/2011/12/lu-bu-sp008.html",
        "demi-god": false,
        "imgUrl": "http://3.bp.blogspot.com/-6lSZ87pxPL0/Tp7Ccs9hjjI/AAAAAAAAA5c/Wl_pTvfVA3w/s1600/splubu8.jpg",
        "abilityText": "Character ability 1: “Horsemanship 马术 (mǎ shù)” [Enforced ability]\nYou will always be at -1 distance in any range calculations.\n(Note: Same ability as Ma Chao 马超)\nCharacter ability 2: “Without Equal 无双(wú shuāng)” [Enforced ability]\nWhenever you use ATTACK杀, your target has to use 2 DODGE 闪 cards to successfully evade the attack. During a DUEL 决斗, your opponent needs to use 2 ATTACK cards for every one ATTACK card that you use.\n(Note: Same ability as the original Lu Bu 吕布.)\nWhen your health decreases to 4 units, your character card has to be changed immediately into this next character card.\nTranslated Description:\n“The Furious God of Battle 暴怒的战神(bào nù de zhàn shén)”\nCharacter ability 1: “Horsemanship 马术 (mǎ shù)” [Enforced ability]\nYou will always be at -1 distance in any range calculation.\nCharacter ability 2: “Without Equal 无双(wú shuāng)” [Enforced ability]\nWhenever you use ATTACK杀, your target has to use 2 DODGE 闪cards to successfully evade the attack. During a DUEL 决斗, your opponent needs to use 2 ATTACK cards for every one ATTACK card that you use.\nCharacter ability 3: “Asura 修罗(xiū luó)”\nAt the beginning of your turn, you can discard one on-hand card in order to discard one Time- Delay Tool Card that is in your Judgement Area. The card you discard must be of the same suit as the Time-Delay Tool Card.\nCharacter ability 4: “Divine Aura 神威 (shén wēi)” [Enforced ability]\nDuring your drawing phase, you can draw an additional 2 cards. Your on-hand card limit is increased +2.\nCharacter ability 5: “Divine Halberd 神戟 (shén jǐ)”\nWhen you have no weapon equipped, your ATTACK card can target up to 3 different players.\nTip:\nThere are no LIGHTNING 闪电 cards and no expansions SO FAR in HuLao-Pass Mode on  SGS online. Since this character is designed for HuLao-Pass Mode, the Time- Delay Tool Cards would only refer to ACEDIA 乐不思蜀.\n"
    }
]